[
  {
    "id": "d8kzu3m",
    "text_content": "Ya this screws me over completely. I was really looking forward to the Note 7. My iPhone 6plus is having an issue where the screen will randomly go unresponsive and I can only fix it by locking/unlocking the screen. I'll call Apple tomorrow and hopefully I can get it fixed. That way it'll last till Samsung gets their shit together for the Note 7. \n\nNo other phone has the features the Note 7 has. The S pen and secure folder are what I'm mostly looking at",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.46416666666666667,
    "include_for_labeling": "Y"
  },
  {
    "id": "5jd0fx",
    "text_content": "Cancelled Samsung Galaxy Note7 still has more users than LG V20, HTC Bolt and OnePlus 3T.",
    "type": "post",
    "score": 95,
    "subjectivity": 0.5,
    "include_for_labeling": "Y"
  },
  {
    "id": "dbfyq3r",
    "text_content": "I traded my Note 7 in for an S7 Edge.  I really hope Samsung provides a good deal on the Note 8 to those of us who were affected by this fiasco.  While I do like the S7, it's a definite downgrade, and that really tweaks my tech-junkie OCD.  I will want to get rid of my current phone as soon as possible in favor of the next Note.",
    "type": "comment",
    "score": 9,
    "subjectivity": 0.41428571428571426,
    "include_for_labeling": "Y"
  },
  {
    "id": "dbgcdgl",
    "text_content": "From reading the independent report of why its battery/design failed. I am glad I didn't hang on to it for safety reasons. But I miss that phone  so much.\n\n",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.40625,
    "include_for_labeling": "Y"
  },
  {
    "id": "dbftpbx",
    "text_content": "Maybe the phone's unique exploding feature (or S Explode) was just something that some users had been crying out for.",
    "type": "comment",
    "score": -4,
    "subjectivity": 0.8,
    "include_for_labeling": "Y"
  },
  {
    "id": "dbfd9yo",
    "text_content": "Im on it right now! #BombsAway",
    "type": "comment",
    "score": -9,
    "subjectivity": 0.5357142857142857,
    "include_for_labeling": "Y"
  },
  {
    "id": "571kfh",
    "text_content": "[Discussion] Note7: for the love of gawd, Samsung don't throw the baby out with the bathwater. The Note platform is an absolute productivity monster. I held on to my Note 2 (which I am back on now, I cannot believe it!) for 4 years because it has helped me do so much. The Note7 was an incredible piece of tech, but the spontaneous combustions wasn't so hot.^ha ^ha ^ha.\n\nPlease, please, please keep making stylus phones. Just make them explode less -- or not at all.",
    "type": "post",
    "score": 11,
    "subjectivity": 0.51,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8ahtfg",
    "text_content": "I got a box Friday in the mail that was to ship it back. It was a pretty intense box meant for the battery issues. Also ordered from Samsung.com\n\n[Same as the one in this post.](https://www.reddit.com/r/GalaxyNote7/comments/558jka/just_received_fire_resistant_shipping_box_from/)",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.53125,
    "include_for_labeling": "Y"
  },
  {
    "id": "574ooo",
    "text_content": "Note 7 users I'm sure like everyone else, you love the Note 7. What phone are you getting to replace it and why? I've been looking around for the past 2 days and don't really like anything else on the market or even the v20 for not being waterproof and no SD card. I'm even considering iPhone 7 plus now. This whole changing out phones has been a giant waste of my time, spent 9 hours over the course of 2 days at AT&T store for Chaning out devices TWICE already. So frustrated",
    "type": "post",
    "score": 3,
    "subjectivity": 0.404,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8pmjse",
    "text_content": "The note7 was the best phone I've ever used but this whole recall fiasco has left a bitter taste in my mouth for Samsung.  I ordered an iphone7 plus as a replacement but I'll have to wait 2 or more weeks for it to arrive.  I just came back from a T-Mobile store and was able to get a Samsung on5 as a loaner, with a $50 deposit.  \n\nI used the s7 edge as a loaner for the first recall and hated how the keyboard wrapped around the edge.   It's gonna be weird switching to iOS but other Android devices available under my carrier seemed like much more of a downgrade than the iphone7.  The only silver lining is that I'll be receiving a $25 credit to my next 2 bills for returning my note7 today.  I hope you find something suitable to your needs, I feel your pain :(",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.49313725490196075,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8owm32",
    "text_content": "I wish I could help, but I'm God damned frustrated myself.  I absolutely love the Note 7.  I'm seriously considering keeping it and rolling the dice, though I'm quite sure the mandatory insurance will refuse to cover it. \n\n\nEffing hell, it's like finding the perfect partner then finding out they've got AIDS.  I'm so sick of looking and so happy, I'm willing to risk dying. \n\n\nEdit:  to *actually* answer your question, I'm thinking the Google Pixel XL maybe.  Still uses Android (and a clearer version), and has the same size screen and C-usb.  Only downside is no S-pen and no water resistant. ",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.657308201058201,
    "include_for_labeling": "Y"
  },
  {
    "id": "54p6qr",
    "text_content": "[Other] I want my potentially explosive Note 7 back Hey all, basically a short vent here.\n\nI got my replacement device on Friday and honestly have had nothing but issues with the thing. It's incredibly slow, gets easily bogged down by tasks my Note 5 and previous Note 7 handled with ease, games actually stutter (these same games worked flawlessly on my Note 5), both the iris and fingerprint scanners are somehow slower, the battery life isn't as good as my old Note 7, my apps in the secure folder no longer work (but they do outside of it) and the thing gets HOT. I mean, very hot! My original Note 7 was always cool to the touch and I was never worried about it over heating but with this one I'm actually scared it will blow up. \n\nI'm incredibly disappointed by this replacement device and wish I had just kept my old one. Restoring the device hasn't helped me and I'm not really sure what else I could do. I work for a phone dealer and the thought of sending it to Samsung has crossed my mind but I don't know if it's really a problem that they could fix.\n\nHas anybody else experienced issues with their replacement devices or did I just get a lemon?",
    "type": "post",
    "score": 10,
    "subjectivity": 0.488,
    "include_for_labeling": "Y"
  },
  {
    "id": "d83uxiz",
    "text_content": "Well this sucks to hear. I want to pick up a note 7 so badly...😭 \n\nI'd get an S7 instead but I want the S pen! My iphone is so outdated and behind, but all the bad juju around the notes is a red flag for me. :(",
    "type": "comment",
    "score": 4,
    "subjectivity": 0.5499999999999999,
    "include_for_labeling": "Y"
  },
  {
    "id": "d83ztej",
    "text_content": "My new Note 7 has been a disaster.  My old Note 7 was awesome.  Always cold to the touch.  Only got a little warm during charging.  Always fast.  Now it overheats constantly.  And the screen is simply not as good as my old one.  \n\nMore importantly, getting ready to take my phone into T-Mobile as I'm having a persistent \"ghost touch\" issue in the top right of the screen.  I have to use the phone in the reduced size mode to simply use it.  Otherwise a million pages open up making it impossible to use.",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.5989861016176806,
    "include_for_labeling": "Y"
  },
  {
    "id": "d84bjqh",
    "text_content": "Definitely check your battery usage. \n\nSomething similar happened with my S6 and it was really slow, would get (and stay) really hot for long periods of time, and its battery would be dead after 4 hours with minimal use. \n\nI think it was an app called Ibotta or something but it was using something like 60% of the battery. After looking at what the ap did, I think that it was constantly pinging my location and finding local sales in the background.\n\nI deleted it and the problem was fixed. No more lag while watching youtube, no more lag scrolling through reddit, no more super hot phone while it sat there on my desk unused.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.47333333333333344,
    "include_for_labeling": "Y"
  },
  {
    "id": "53pacg",
    "text_content": "My Note 7 Replacement Experience (Canada) UPDATE 21/09/2016:\n\nSpent another hour on the phone with Samsung, got transferred three times. Again, they said that they will escalate this problem to their manager. \n\n\n\nHello everyone,\n\nI would like to share my experience with getting a replacement Note 7 unit.\n\nI pre-ordered my Note 7 with Bell Canada and got the phone around September 1st. After receiving the notice for the recall, I submitted the replacement form on September 7th.\n\nThe replacement website stated that I \"will be contacted by a Samsung representative within 48 hours.\" I heard nothing from them. I also didn't get any email confirmation after I submitted the replacement form.\n\nI also contacted Samsung about the screen protectors and DBrand skins that I had already applied on the current phone(probably about $40CDN total) and asked for some kind of compensation for the amount I spent. After bouncing me around different departments, I ended up at Complaints (I am not sure why) and all I got was a monotonic \"I understand your concern, but Samsung is not going to pay for your accessories.\"\n\nFast forward a few days later, I suddenly received an email from FedEx telling me that I have a package coming, from sender \"STERICYCLE RMS/CANADA\". I have no idea what this company is until I googled online and some users pointed out that it is the Note 7 replacement unit. Again, I was told that they will contact me to confirm the color of the phone and the address.\n\nHowever, the delivery address is the one that I used to register with my phone carrier. It hasn't been updated for years. This address is certainly not the one I registered the replacement form with. I have no clue how they got this information.\n\nSince Friday, which is the day I received the FedEx notice, I have been contacting Samsung and FedEx trying change the delivery address. With FedEx, they told me that the value on the package is too high for the receiver to change the address.\n\nAt Samsung, no one knows how to change the address and no one seemed willing to help out either. The department that handles the Note 7 Replacement says that they only help people with replacement registration and not responsible for anything afterwards. The main customer service line refers me back to the Replacement number.\n\nI have probably wasted 10+ hrs on the phone with them. It was not just the fact that they had no clue what was going on; Samsung customer service's tone and attitude pretty much gave me cancer.\n\nRight now the package is \"Out for Delivery\" at a city no where near where I live and I have no idea what to do.\n\nI am so disappointment with Samsung as a company and how they handle problems like this. It really shows how bad the internal communication is.\n\nI am going to try to get a refund for the Note 7 and change it to either an iPhone or wait until the new Nexus(or Pixel) phones come out. I am done with Samsung for the time being.\n\nThanks for reading, and I hope the rest of you guys receive your Note 7 replacement without too much trouble. And have a good day! :)",
    "type": "post",
    "score": 13,
    "subjectivity": 0.456,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7v4i78",
    "text_content": "I feel your pain.  I filled out that form over two weeks ago and haven't heard anything.  No calls,  no emails,  nothing.  At this point,  much like yourself,  I might just exchange it for the new Google phone. ",
    "type": "comment",
    "score": 5,
    "subjectivity": 0.5181818181818182,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7vxph6",
    "text_content": "Filled one out the day bell sent me that annoying text. \n\nI accidently chose to have it delivered to a retailer... I haven't heard shit since and bell keeps telling me Samsung will send it to me. I guess I'll just keep using my bomb phone. ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.8666666666666667,
    "include_for_labeling": "Y"
  },
  {
    "id": "53ic1k",
    "text_content": "Note 7: Samsung can no longer take returns (If ordered through Samsung.com) (I ordered my Note 7 Directly from Samsung.com)\n\nI was on vacation when the whole recall thing started. I finally got home and found out FedEx, UPS, USPS are no longer taking the Note 7 back to Samsung because of the possibility of them exploding (As of 9/16/16). I called Samsung's eCommerce dept and they gave me a new number to call. I called them and they told me to stop using the device and sit on my hands until they figure something out. WTF samsung. Anyone else having issues exchanging their notes through Samsung? (Not talking the people who got their Notes from brick-n-morter stores.)\n\nEDIT from 10/1/16: Still waiting for Samsung to figure out what the hell to do.  I not decided to just return it, tired of this shit customer service.",
    "type": "post",
    "score": 24,
    "subjectivity": 0.594,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7vblas",
    "text_content": "OP I sell stuff for a living. I am telling you right now you need to call them and not get off of the line until you have a solution or a refund. If they refuse, kindly tell them you will be doing a chargeback to your account and that they may pick up the device at X address. Fuck that.",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.6785714285714285,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7teq5q",
    "text_content": "Da FUK!!!!!!!!!!!!\n\nthis is a total nightmare",
    "type": "comment",
    "score": 0,
    "subjectivity": 0.75,
    "include_for_labeling": "Y"
  },
  {
    "id": "50wf7x",
    "text_content": "For anyone who bought a Note 7 from non-retailers. We're pretty much stuck with a ticking time bomb :( and 800 bucks down. \n\nhttp://imgur.com/a/UEhNW",
    "type": "post",
    "score": 4,
    "subjectivity": 0.622,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8n1lxb",
    "text_content": "This fucking sucks. I know I should return my Note 7 but there are not any phones that come close to matching it. Fuck this situation.",
    "type": "comment",
    "score": 21,
    "subjectivity": 0.44999999999999996,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8mums6",
    "text_content": "What a joke, what an absolute joke. What the fuck are they doing?? They already fixed them right?? \n\nThis will destroy the Note series, I have never seen a tech disaster like this before. \n\nHanded in my Note 7 yesterday. Good, fuck it. Not worth the hassle dealing with Samsung again. ",
    "type": "comment",
    "score": 15,
    "subjectivity": 0.44196428571428575,
    "include_for_labeling": "Y"
  },
  {
    "id": "5hrjxt",
    "text_content": "I know buying and selling is frowned upon, but maybe you guys can help. I want to find a Note 7. New preferred but used is okay. READ! I know, I know, recall, safety hazard, blah blah blah. I want one for collector's value. It will not ever be powered on, it will sit in the box in a hard protective case in a safe for several years until it's extremely collectible and sought after. That said, IF YOU HAVE ONE, I WANT IT. NAME YOUR PRICE! I WILL PAY UP! Any carrier, any storage, and I don't care if it's the original N7 or the replacement S version. \n\nI'd be willing to offer AT LEAST $900-1000 to anyone who has one, and if it's new in box sealed, I'd be willing to start around $1200-1300 or even more. I also have some other rare collectible electronics I could trade you. In contract? I'll buy out your contract for you as well so you don't have to trade it in! Over 93% of these devices have been returned so I NEED ONE ASAP!!! Please help, or even help link me with someone who has one! \n\nIn addition, if you can link me to someone who has a Note 7, AND it results in a completed sale, I am willing to offer $100.00 as a finder's fee!\n\nPlease, I am NOT kidding around here! I am COMPLETELY SERIOUS! I will pay through PayPal, and have it shipped FedEx with full insurance and signature, hell, if you're in the continental USA, I'll fly to you to pick it up and pay in cash!",
    "type": "post",
    "score": 4,
    "subjectivity": 0.597,
    "include_for_labeling": "Y"
  },
  {
    "id": "521mg3",
    "text_content": "Who here is still holding on to their Note 7's despite the recall? What precautions are you taking? As the title says. I for one can't be arsed to swap my Note 7 to something else, only to swap it back to a Note 7 later. It took me forever to transfer and set everything up this time round. Plus, for AT&T at least, it seems they're only giving you the new phone once you send your current one in, which kinda doesn't give me a lot of options for backing up and transferring my data. So I'm waiting for the fixed Note 7s to come out again, before I do my swap.\n\nI for one have disabled fast charge, kept my phone out of the sun/heat, and only either used OEM chargers or Qi wireless charging. Basically, try to keep the amount of juice you're pumping into the battery minimal - enough for a charge, but not so fast it causes overheating. I also theorized that some of the explosions could've been caused partly by third-party USB-C chargers (the cheapo Chinese ones) that aren't certified (look up the Google guy whose Macbook got fried because of a cheap USB-C charger and started certifying them from now on).\n\nFrom my limited understanding of batteries in engineering school and from the reports about hot Note 7s before they explode, I'm also minimizing the amount of heat it generates - every time my phone starts to feel warm, I stop charging and cool it under cold water immediately. I also stopped using it while it's charging.",
    "type": "post",
    "score": 3,
    "subjectivity": 0.518,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7gn7s4",
    "text_content": "Tbh im not sure man. They texted not too long ago saying to turn it off and  exchange. I actually just got an email from samsung right now. Will check soon. But im not sure, i may wait a day maybe or until monday i work tomorrow so no other Cell phone to use. Kind of playing by ear for now. It does get hot charging but i make sure to watch it if i do charge it and never overnight or unattended. So far no concerns but who knows. I really liked my note",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.6933982683982683,
    "include_for_labeling": "Y"
  },
  {
    "id": "5b9232",
    "text_content": "Getting really frustrated with the Note 7 exchange in Australia. I am seriously getting frustrated with the Note 7 exchange program here.    \n  \nI bought a Note 7 from a store in Singapore, was force to leave it behind and had a family member ship the replacement Note 7 to me. And now the saga really begins.  \n  \nSo the 2nd Note 7 recall begins, I go to a Samsung store in Australia, they tell me I have to go through support.  \nI call support on October 13 and they say 14-21 buisiness days for processing and I get a replacement Edge 7.    \nOK, that's fair organizing this stuff takes time, etc.  \nNow, I get a call on Nov 3rd, \"Oh your processing is complete, now wait up to 21 business days  for us to send a courier to your door, no we aren't going to make sure he calls you to arrange some pickup time, it's down to pure luck if you're around at that time, he might leave you a note if he can't find you. \" Well duh, we haven't coordinated jack! Are they just expecting me to be at my apartment for the entirety of the next 21 days?  \n  \nOh and they'll be sending me the gift voucher by SNAIL MAIL, and they are only posting it after I make the exchange.  \nSo that's another week or so of hoping I don't drop my phone face first, or just wasting that money buying the case out of pocket.  \nOh and they were also apparently out of my first choice of color too, they only told me that in Novemeber.  \n   \nMy only question is: WHY?  \nWhy can't I just go to a service center somewhere, hand in my phone and get the new one. I'd take an Uber to some random warehouse in the outback if it would be faster.  \nWhy can't they just email me the voucher, or hand it with the courier who is apparently authorized to handle a $1000 device.   \n  \nI was still a Samsung fan after the first recall, now this second recall is has killed any brand loyalty to Samsung. If one more thing messes up with this process I'm not even going to consider them for my next phone.  \n\n/Rant over",
    "type": "post",
    "score": 11,
    "subjectivity": 0.41,
    "include_for_labeling": "Y"
  },
  {
    "id": "52emjx",
    "text_content": "Is it only the Galaxy Note 7 being recalled, or the Galaxy S7 / Edge? Canada if it matters I tried googling through some results, but everything I find just talks about the Note 7, although I have heard of the S7 and S7 edge exploding as well.\n\nIs there a Recall on the S7?",
    "type": "post",
    "score": 4,
    "subjectivity": 1.0,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7jnbrv",
    "text_content": "The Note is the only one that has been recalled for now, but it's only a matter of time before the exploding Edge is recalled as well:\nhttps://www.classaction.com/news/exploding-galaxy-edge-s7-causes-3rd-degree-burns-man/\nSamsung keeps downplaying the battery issue, but they have a full-blown crisis on their hands...",
    "type": "comment",
    "score": 1,
    "subjectivity": 1.0,
    "include_for_labeling": "Y"
  },
  {
    "id": "5h18ql",
    "text_content": "Samsung hasn't shipped me a Note 7 return box yet. I'm moving to another state in two week and I have no idea what to do I purchased a note 7 directly from Samsung.com.\n\nAfter receiving the device, I moved from the west coast to the east coast. Once I heard the news about the recall, I contacted Samsung and informed them that I have moved and that I'm requesting a refund. The agent assured me that shouldn't be an issue and that I should be receiving a return package within 3 to 5 business days. As far as I know, the package went to my old address.\n\nEver since then, I have been calling Samsung at least twice a week. Every time I call, I get the same answer, we made a mistake, we fixed it and that I should be receiving a return package within 3-5 business days.\n\nI started this process around Oct 11th. It's now Dec 6th. I have called Samsung more than 35 times and I have spent more than 9 hours speaking to various agents and supervisors (have records from Sprint that proves this.)\n\nI'm moving out of the state I'm in now in two weeks. I'm extremely worried that I won't be getting a return package before then. Because I'm not allowed to fly with this phone, I have to leave it behind. It is not fair to lose the money I have spent on this phone because Samsung seems to fail at sending me a package. I'm absolutely desperate.\n\nI have tried reaching out to their their social media team and they referred me back to the phone numbers I have been calling for the last seven weeks. I emailed Samsung ecommerce team and I haven't gotten any responses back. I contacted my carrier (Sprint) and they said they can't do much for me because I bought the phone directly from Samsung.\n\nA typical day for me now: http://imgur.com/WynFXuX",
    "type": "post",
    "score": 2,
    "subjectivity": 0.402,
    "include_for_labeling": "Y"
  },
  {
    "id": "51mixz",
    "text_content": "Note 7 recall question. So as I was working today my phone hit my leg quite hard and of course damage was done. Right under my home button is a tiny tiny spider crack aboiut a 1/4 the size of the button itself. With the recall are they gonna hit me for stuff like that?",
    "type": "post",
    "score": 2,
    "subjectivity": 0.519,
    "include_for_labeling": "Y"
  },
  {
    "id": "523zdp",
    "text_content": "Discussion: How long do you think it will take to the Note 7 hit the market again? Pre-ordered mine and now i'll have to wait longer xD! Really hope it doesn't take long but maybe only in october.",
    "type": "post",
    "score": 6,
    "subjectivity": 0.5,
    "include_for_labeling": "Y"
  },
  {
    "id": "51na1m",
    "text_content": "Anyone been able to exchange a recalled Note 7 for a new Note 7 yet?",
    "type": "post",
    "score": 6,
    "subjectivity": 0.54,
    "include_for_labeling": "Y"
  },
  {
    "id": "50vfxn",
    "text_content": "Returned Note 7 to T Mobile for recall. I went today to the T-Mobile store to see what was going on. First, T mobile website claims that the Note 7 devices can be turned in for a full refund (or whatever you've paid on lease/jump) In addition, any accessories can be returned.\n\nThe T-Mobile reps were probably the worst, none of them knew anything. I had to explain to them the post on their own website, the TMobo Manager was dumbfounded. All they knew was to stop selling Note 7 devices. So the manager called HQ or whatever is there store's head. They further prompt her to take my device(Note 7) and:\n\nOption 1:\n-Refund any payment made for the phone ($69.99 upfront cost and a monthly charge $40) \n-I brought back the S view case (without packaging and Gear VR) and they provided a full refund to my card. (No, restock fee) \n-Third they drop a Jump! on Demand and let me Jump! to another phone (I took the iPhone 6S for now, maybe wait for the note 7 or iPhone 7 ill see.)\n\nOption 2:\n\n-Keep your Note 7, let them put a note and request on your account that you want a new Note 7 and wait an estimate of two weeks for new stock of Note 7 that are \"fixed\" They told me it will be a brand new box/phone that I will receive.\n\nNote: \nI took option 1, because I didn't want the Gear VR and S View Case so I found the perfect opportunity to get a refund. Also, GO TO YOUR THE T MOBILE YOU BOUGHT YOUR PHONE. I went to a different T mobile store they sent me to my original store. My phone also had hairlines cracks and they still took it. Maybe everyone will have different experiences, but here was mine. Overall, company policy was great no complaints, the T mobile reps sucked.\n\nEdit: Also got to keep my Netflix sub too.",
    "type": "post",
    "score": 2,
    "subjectivity": 0.537,
    "include_for_labeling": "Y"
  },
  {
    "id": "d77vkke",
    "text_content": "T-Mobile's reps do suck! I got 2 defective Note 7s & had a hell of a time with T-Mobile. I posted about it [here](https://www.reddit.com/r/tmobile/comments/50kmx9/2nd_boot_looping_note_7_tmobile_wont_exchange_it/). The stores not being able to help you most of the time drives me crazy!\n\nFrom my understanding, if you got a refund you've been dropped out of the JoD program & won't be able to get back in. ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.53,
    "include_for_labeling": "Y"
  },
  {
    "id": "58dawf",
    "text_content": "What's the best way to contact Samsung about not being pleased with how they handled the note 7 recall?",
    "type": "post",
    "score": 6,
    "subjectivity": 0.65,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8znb5y",
    "text_content": "They won't give a shit unless you sue them, the $100 credit for exchanging to s7/s7e is a shit deal when they offered $200 discount at launch for Note 7 in Canada",
    "type": "comment",
    "score": 6,
    "subjectivity": 0.8,
    "include_for_labeling": "Y"
  },
  {
    "id": "51r7g1",
    "text_content": "I'm guess the promotion still goes on when the note 7 becomes available again?",
    "type": "post",
    "score": 13,
    "subjectivity": 0.4,
    "include_for_labeling": "Y"
  },
  {
    "id": "5kpx36",
    "text_content": "Holding out hope for S8... So, I work for Samsung... I LOVED the Note7. Everything about it was great... exept for the whole blowing up flaw. Rumors abound say that Samsung will likely stop continuation of the Note line, and that the Galaxy S line will be the flagship going forward. That said, one of the best things I loved about the Note was the bigger screen, and the s-pen. I can live without the pen, but if the actual phone size rumors of 5.5 and smaller are to be believed, I think I will be done with Samsung phones for the forseeable future. I reverted back to my Note3 when they forced the Note7 Recall and it's beginning to show it's age. I'd REALLY like for the 6.2 rumor to be true, but I could live with 5.7, anything less than 5.7 and i'm outtie...",
    "type": "post",
    "score": 9,
    "subjectivity": 0.435,
    "include_for_labeling": "Y"
  },
  {
    "id": "58t6hm",
    "text_content": "Help with restoring Samsung backup without Samsung phone. Hi all, due the Note 7 recall I returned my Note 7 and am now using the Pixel (Don't hate >_>). Unfortunately I made the mistake of using Samsung account to backup contacts and texts etc.\n\nDoes anybody know a way of restoring data from a samsung backup with a samsung phone? \n\nThanks.",
    "type": "post",
    "score": 4,
    "subjectivity": 0.619,
    "include_for_labeling": "Y"
  },
  {
    "id": "52o81j",
    "text_content": "This is a mess... Like most people, this Note 7 recall has been a serious inconvenience. Verizon customer service has been awful, not one person has given me a straight answer. From the jist of the internet speak it sounds like I can either stick myself with another phone, grab a loaner that screws you out of months of your contract as well as being a serious downgrade, or watch my college dorm go up in flames. My phone doesn't get any hotter then any of my previous phones when charging so I can't rationalize spending all this time (stressed out enough as it) to try and return a phone that myself and my parents collectively dropped 700$ on. \n\nrant over",
    "type": "post",
    "score": 2,
    "subjectivity": 0.509,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8oesdb",
    "text_content": "the ui is different. kinda sucks. feels cheaper. no pen. slightly smaller screen. i just got one today for my note 7. :( over not a bad phone.\n\nbetter battery",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.5944444444444444,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8nremd",
    "text_content": "have note 7 and tried s7e in order to replace it with note 7 . tbh note 7 is better than the s7e , and u will feel the differ if u came from note 7 to s7e , if u want safety get s7e , if u want the best phone in the market then note 7. however i noticed diffrences in the main ui and the fast the note 7 deals with apps , note 7 is alot faster than s7e , i didnt try the camera, i dont use it anyways , but obv better , aside from that i didnt notice anything cuz i only used note 7 for 2 days and s7e for 10 minutes ,so i cant say for sure. \n\nEDIT: i forgot to mention that but i got addicted to note 7 iris scanner lol :P very fast and easy ,only downside it doesnt work on direct sunlight . it works ok in dark areas.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.6459722222222223,
    "include_for_labeling": "Y"
  },
  {
    "id": "56zmln",
    "text_content": "[Other]To Samsung From a Note 7 User Dear Samsung, \n\nI'm sorry you are having a bad day/month/year. I have to say it is with reluctance that I am giving up my Note 7. I love the phone. It has everything I want from a phone. Not only does it look gorgeous and feel smooth and solid, but it has the specs that to match its smooth exterior. It is the Mercedes of phones. \n\nI have had my Note 7 since day 1, I preordered it the day it was announced and picked it up on release day. I was so excited I annoyed the hell out of my fiancee. All I talked about for days was my phone. I even took they day off of work to be home for the delivery of my Gear VR 2.0. \n\nSpeaking of the VR experience, it was amazing. Not only did the headset fit my giant size 8.5 head, it was comfortable. I played for hours. I'm going to miss it. \n\nI'm frustrated right now because I don't know what phone to get. I don't want the S7 because I will be stuck in it for the next 2 years, and the S7 is already out dated. I've been looking at the Pixel XL, but it doesn't have the smooth rounded finish of my Note 7, nor the pen, or the SD card slot, or even my iris unlock. Maybe I'll just keep my Note 3. \n\nI wish you luck. I hope that we can meet up again in two years.",
    "type": "post",
    "score": 115,
    "subjectivity": 0.64,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8o1jue",
    "text_content": " I already switched back to my note 3. There's just nothing out there that I want right now especially after owning a note 7 for two months. It is so good that I'm still willing to use and own it if they could guarantee it will not catch fire.\n\nThe curved and rounded edges felt much better in my hand than any other phone. I hope Samsung doesn't axe the look and feel of the phone because it was great. If they came out with note replacement that is just different hardware stuffed into the note 7 skeleton I would buy it after waiting to see if it spontaneously combusts or not (sorry Samsung, but trust was lost).\n\nI might make another post depending on how the refund situation turns out. I got my phone through my carrier and it doesn't really make sense that I have to wait for Samsung to refund me instead of my carrier. Mail sucks where I live so this whole get a box in the mail to return it thing will likely turn into another fiasco for me.",
    "type": "comment",
    "score": 6,
    "subjectivity": 0.6123949579831933,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8o39k7",
    "text_content": "I agree with you, Although I have a note 5 which I'm surprised to say I'm decently content with.... \n\nI finally got the wife to upgrade from her s4 and she's absolutely gutted, she wants her note 7 back in a bad way, and the s7 edge doesn't really cut it, So I'm in the same place, might end up giving the kids an s7 edge when there's a note 7 replacement. ",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.5064814814814815,
    "include_for_labeling": "Y"
  },
  {
    "id": "57bovt",
    "text_content": "Survey says 40% current Note 7 users will never buy another Samsung phone",
    "type": "post",
    "score": 41,
    "subjectivity": 0.4,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8qv6ak",
    "text_content": "I don't buy it. 90% of Note 7 owners got replacement Note 7s with the first recall.\n\nAnd your title is wrong. The online survey was done among Samsung phone owners, not Note 7 owners. It likely captures a bunch of clueless consumers who don't actually have Samsung phones.",
    "type": "comment",
    "score": 22,
    "subjectivity": 0.5833333333333334,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8qtduv",
    "text_content": "I can't say never, but I'll definitely be taking a break from Samsung with the Pixel XL. Maybe in a year or two I'll reevaluate after I see how Samsung has handled things, and what direction Google is headed with their project.",
    "type": "comment",
    "score": 4,
    "subjectivity": 0.5,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8rgmb8",
    "text_content": "Pixel isn't the only option...... S7 Edge.",
    "type": "comment",
    "score": 1,
    "subjectivity": 1.0,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8rmdfi",
    "text_content": "There's a difference between what someone says in a survey during a period of heightened negativity towards Samsung and what they do in a year or two when they release a new phone that everyone is raving about.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.45454545454545453,
    "include_for_labeling": "Y"
  },
  {
    "id": "53r85e",
    "text_content": "Anyone else surprised Samsung isn't doing some sort of promotion to help bring people back to the Note 7 now after this problem?",
    "type": "post",
    "score": 17,
    "subjectivity": 0.45,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7vs5km",
    "text_content": "Finally got my my new Note 7 today and im honestly so glad this whole ordeal is over for me\n\nWould be cool if they hooked us up with something for sticking by them but I wouldn't expect them too or be upset if they didnt",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.7009090909090909,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7vzixk",
    "text_content": "Not really, when i was talking to samsung support about getting compensation for the whole debacle, they kept trying to explain how they are replacing the phone \"with a brand new phone\" for *free* as if that was like some special deal i'm getting. ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.48519480519480523,
    "include_for_labeling": "Y"
  },
  {
    "id": "514dca",
    "text_content": "Anyone keeping their Note 7 until the replacement is offered? So I ordered my Note 7 from AT&T. Is anyone just going to wait until they start offering the Note 7 as a direct replacement before exchanging it? The risk of explosion should be pretty damn low, right?",
    "type": "post",
    "score": 25,
    "subjectivity": 0.559,
    "include_for_labeling": "Y"
  },
  {
    "id": "d797lym",
    "text_content": "Keeping it until Samsung sends replacement. Love this phone. Cold as cucumber while charging. No worries here.",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.8,
    "include_for_labeling": "Y"
  },
  {
    "id": "d79rzxa",
    "text_content": "Mine went into a boot loop while charging after it got really hot last night.  I had to trade it in today and got a S7 Edge...I was going to hold out but it forced my hand.  :\\  I can't wait to get another Note 7.",
    "type": "comment",
    "score": 4,
    "subjectivity": 0.5291666666666667,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7986k8",
    "text_content": "I'm actually returning mine and will be waiting for the cheaper refurbished handsets to hit the market and just re-purchase it.\n\nMy phone gets hot though",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.47500000000000003,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7elwfw",
    "text_content": "I just came from a Note 4 and I can say that the Note 7 is very worth the upgrade it seems like its better in every way and it has a great feel to it. ",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.45999999999999996,
    "include_for_labeling": "Y"
  },
  {
    "id": "545bxr",
    "text_content": "Replacement Note 7 battery drain worse?? So I got my replacement.. It definitely isn't as hot as the original, but the battery drain is faster in my opinion . Are any others seeing this as well?",
    "type": "post",
    "score": 14,
    "subjectivity": 0.733,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7z01vy",
    "text_content": "No.I don't see any changes in battery life. It's just awesome for all the features this phone has. I got the original Note7 on Aug 19 and after the recall got replacement on September 18th.\n\nJust now I checked, today it has given 7 hours SOT with 10% charge remaining. \nhttp://i.imgur.com/tIUcrGh.jpg",
    "type": "comment",
    "score": 4,
    "subjectivity": 0.875,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7znpfj",
    "text_content": "Been on my phone all day and haven't charged it at all, now on 40% battery life is much better....",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.5,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7zadft",
    "text_content": "I've noticed a significant change, and I'm not even at the rate of apps I had on the first version of the Note7. ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.6041666666666666,
    "include_for_labeling": "Y"
  },
  {
    "id": "4zefxu",
    "text_content": "Discussion: Note 7 Battery Life I'm curious to see what everyone is experiencing in terms of battery life. I am admittedly disappointed, with only 30 percent battery left I only got 2 hours of screen on time. I've disabled all of samsung's battery taxing features and have limited my use to texting and light web browsing. Is anyone else experiencing similar issues? \n\nEDIT: I've now tried factory resetting the phone per the advice of some others but it doesn't seem to have made a difference. After searching some forums it looks like disabling the KNOX services as well as OM Customize resolved the issue for others so I'll be trying that today.",
    "type": "post",
    "score": 2,
    "subjectivity": 0.588,
    "include_for_labeling": "Y"
  },
  {
    "id": "d6vaux8",
    "text_content": "I guess I'm lucky, so far I'm averaging a day and a half of use to drain the battery. I did go through and disable a good portion of the at&t/samsung preinstalled apps though",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.65,
    "include_for_labeling": "Y"
  },
  {
    "id": "d6v6q6k",
    "text_content": "Same here.  My AT&T Note 7 can't make it through the day without being charged and it dropped 15-20% overnight.  Something is not right.  The main battery drainers are Android OS and Android System, so not sure how to fix.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.470734126984127,
    "include_for_labeling": "Y"
  },
  {
    "id": "502wqq",
    "text_content": "PSA: Galaxy Note 7 AT&T Battery Issues So this is sort of a follow up post to one I made the other day about experiencing issues with the Note 7 on AT&T. After trying to disable almost everything, I decided to take my phone back into the store I purchased it from while I was still within the exchange time window. When I brought the phone to the Samsung representative and told him I was experiencing battery issues he knew exactly what I was talking about. He explained to me that although not confirmed, the latest update from AT&T was causing massive battery draining issues for the Note 7 phones. I was able to exchange it for a new one per his advice. He told me not to update the phone until the next major software update. He also informed me of an AT&T feature that caused battery draining. In Settings->Connections->Mobile networks->Mobile data, there is a setting that is switched on by default by AT&T called Enhanced LTE Services. After switching this off my battery has been absolutely phenomenal.",
    "type": "post",
    "score": 8,
    "subjectivity": 0.51,
    "include_for_labeling": "Y"
  },
  {
    "id": "5250ve",
    "text_content": "bestbuy on the note 7 talked with a best buy employee who told me about the fault,  there's a sensor in the phone that decides when fast charge or trickle should be used, that sensor on some phones is faulty causing the phone to stay in fast charge and over load or over heat the battery, he suggested that if im going to wait for the new batch of note 7's to visit http://www.bestbuy.com/site/clp/galaxy-note7-information/pcmcat748302046994.c?id=pcmcat748302046994\nand sign up for notifications on stock, but to turn off fast charging, and only charge it when you're around it and can keep an eye on it.",
    "type": "post",
    "score": 6,
    "subjectivity": 0.592,
    "include_for_labeling": "Y"
  },
  {
    "id": "594975",
    "text_content": "So here in Korea Samsung announced an upgrade program for Note 7 owners and because I bought the phone directly from them full price, I can't participate. Where is the logic in that garbage. In Korea they announced a program where you can exchange your S7 or S7 Edge you got after exchanging your Note 7 for 50% off a s8 or note 8 but it's only available to people on a plan paying off their phone and not to people like me that bought the phone directly from Samsung at their store for the full 1,000,800 won price tag. \n\nI've called and asked them and everything and they do indeed tell me I cannot participate in this because I bought it from them and not from a carrier with a plan. So I'm not just reading it wrong. Some absolute garbage.",
    "type": "post",
    "score": 46,
    "subjectivity": 0.638,
    "include_for_labeling": "Y"
  },
  {
    "id": "d95jfl7",
    "text_content": "The customer service aspect of this problem is garbage. I think stunts like this are hurting more than an explosive device.",
    "type": "comment",
    "score": 12,
    "subjectivity": 0.5,
    "include_for_labeling": "Y"
  },
  {
    "id": "d96qei1",
    "text_content": "50% off isn't even a great deal, some people were under the impression it was going to be nearly free\n\nDunno about korea but pretty much anywhere else you can sell a year old phone for at least half the value, which is essentially what they're offering as compensation for a major fuck up\n\nHere in Canada the S7E has a trade-in value of $325 currently, with every new flagship release they have a $150-$200 discount if you trade in a phone and that combines with the trade-in value of your phone so that's a $525 discount if the value doesn't drop\n\nUnless I misinterpreted the offer and you don't have to trade in your phone then it's still pretty ass since you'll have to sell it anyway if you're getting a new phone \n",
    "type": "comment",
    "score": 7,
    "subjectivity": 0.5161255411255411,
    "include_for_labeling": "Y"
  },
  {
    "id": "d96dynk",
    "text_content": "This whole situation by Samsung shitting on their own direct customers is why I flat out returned my Note 7.  I was given the run around as well when I purchased mine from Samsung.com.  Yet if I went to a brick and mortar store like BestBuy, I would have had so much better service.",
    "type": "comment",
    "score": 5,
    "subjectivity": 0.485,
    "include_for_labeling": "Y"
  },
  {
    "id": "d98a0j3",
    "text_content": "Very disappointed it's not for everyone still using Samsung devices and I'm on an Edge plan with Verizon.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.9750000000000001,
    "include_for_labeling": "Y"
  },
  {
    "id": "5c7hst",
    "text_content": "Why Samsung has completely lost me as a customer Hi, I was a Galaxy Note 7 owner, and would like to share with you the nightmare that was (and is) the refund process.\n\nSome background,\nI bought my Note 7 in Singapore from a telecommunications company and signed a 2 year contract. This meant that I received the Note 7 at a slightly discounted price of around £420. However, I moved to the UK to pursue my studies in University, and was not able to make the refund/replacement window in Singapore. I contacted Samsung and they told me that they would replace/refund the phone directly for me while I was in the UK. Everything seemed fine.\n\nThat's when the nightmare began:\nIt has been close to two months of calls and emails to Samsung, mostly taking 2 emails for them to reply me once. Every time I emailed them, I received replies that told me that it was processing, and would take 2-3 business days. 10 days without communication later, I would email them again to receive the same reply. Calls were even worse, as the customer service representatives had no idea what was going on. They were only able to take down my IMEI and serial number, and say that it was submitted for processing.\n\nFinally, I received the offer for refund for my Note 7. Except that instead of refunding the full retail price of the device, as the customer representative had claimed they would, the offer was for slightly less than £420. This meant that I had paid for the contract, not been able to use the phone, and had to buy a new Pixel XL, while Samsung was not going to even refund me the full price of the phone. My local telecommunications company had put on their website that Samsung would be refunding the full price of the phone plus a SGD$100 credit, which was clearly false. \n\nBad enough as it was, Samsung had the audacity to insert a reference to the \"age of the device\" when calculating a refund amount. This is ridiculous in more than one way, as I was not able to use the phone after it was deemed unsafe, and the reason why I have had the phone for so long is because of the inefficiency on Samsung's side.\n\nSamsung's utter lack of care for their customers is disgusting. Instead of compensating me for having this unsafe device in my possession and being unable to use it for 2 months, they cause me further financial losses as well as put me through what is frankly the absolute worst customer service experience I have had. \n\nI am a huge supporter of the Note line, having owned the Note 2, Note 8 Tablet (the forgotten Note), and the Note Pro 12.2. But I will never opt for a Samsung device ever again after this terrible experience.\n\nTLDR; Samsung's service in the refund process is the worst, and they put the burden of the loss on their consumers.",
    "type": "post",
    "score": 4,
    "subjectivity": 0.571,
    "include_for_labeling": "Y"
  },
  {
    "id": "d9vj056",
    "text_content": "Yup took me 60 days of high blood pressure and calling them to finally get a shipping label that should have arrived in 1-3 days. Lol",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.7466666666666667,
    "include_for_labeling": "Y"
  },
  {
    "id": "d9uaa1z",
    "text_content": "I keep hearing these horror stories about Samsung customer service. Its absolutely pathetic and horrible. ",
    "type": "comment",
    "score": 0,
    "subjectivity": 1.0,
    "include_for_labeling": "Y"
  },
  {
    "id": "4ypre9",
    "text_content": "Note 7 Random Reboot This is driving me crazy! My new Note 7 randomly reboots, but every time it vibrates then vibrates again about 3 seconds later before it reboots. I can't figure out what's causing it. Anyone have any idea? I really don't want to do a factory reset already. I just got all the settings set in the apps. \n\nUpdate: Would that be what it would do if it was over heating? Cuz it seems really hot. I don't ever remember my S7 Edge getting this hot.\n\nUpdate 2: Did  3 factory resets & it still randomly vibrates then reboots. Store is out of them & T-Mobile has them back ordered. :-(\n\nUpdate 3: Called & they are sending a new one since it's within the 14 day grace period. Sounds like it's a known issue since I'm not the only one seeing this.\n\nUpdate 4: Called because I never heard anything. Phone replacement \"order\" was never finished by the representative, so it was never shipped. So I spent another hour on the phone being passed from one department to another trying to get yet another replacement. This is getting downright ridiculous! It took me 6 calls & a trip to the store to preorder the phone now all this time wasted getting a replacement. \n\nUpdate 5: Got a replacement & it does it even more than the old one!!!! FML\n\nUpdate 6: They are sending me a 2nd replacement. The representative said that I was the 3rd person he talked to today that needed a replacement. There's a few [vids](https://youtu.be/_kqjZzApEZE) showing it on youtube too. So annoying & odd.\n\n[2nd phone](https://www.reddit.com/r/tmobile/comments/50kmx9/2nd_boot_looping_note_7_tmobile_wont_exchange_it/) did the same thing & worse! I think it's the bluetooth that was causing issues. Before I sent the phone back I had turned off the bluetooth & it stopped freezing & rebooting. Not that I'm an 100% sure that was the cause but maybe something to look at if anyone is reading this.",
    "type": "post",
    "score": 4,
    "subjectivity": 0.424,
    "include_for_labeling": "Y"
  },
  {
    "id": "d797ndy",
    "text_content": "Amazing phone. No issues whatsoever. Love it.",
    "type": "comment",
    "score": 10,
    "subjectivity": 0.75,
    "include_for_labeling": "Y"
  },
  {
    "id": "d793z5w",
    "text_content": "When it's not scalding hot it's amazing! ",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.875,
    "include_for_labeling": "Y"
  },
  {
    "id": "d79e10z",
    "text_content": "It's great, I only lost 3 fingers when it exploded! ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.875,
    "include_for_labeling": "Y"
  },
  {
    "id": "d793dme",
    "text_content": "Yes. You will not only see a slightly different battery, buy software and the new \"all glass design\" will look especially good in blue coral.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.630909090909091,
    "include_for_labeling": "Y"
  },
  {
    "id": "d79e8r8",
    "text_content": "I love mines. I can from. The note 5 and it makes me feel like my note 5 was defective or needed a full reset/wipe. The battery life us much better and it's very responsive and snappy. I will be replacing mines when I can get an on the spot replacement in store and hoping my replacement works as flawlessly as this one does. ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.5900000000000001,
    "include_for_labeling": "Y"
  },
  {
    "id": "53o82x",
    "text_content": "Will replacement Note 7s be allowed for use on flights? It seems the FAA has banned the Note 7 for use on flights. I can't find any info about if this covers the replacement units or when the ban will expire. Want to get my replacement unit tomorrow, But if I can never use it on a flight I will have to explore other options. Anyone have any more info?",
    "type": "post",
    "score": 10,
    "subjectivity": 0.438,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7v1mbg",
    "text_content": "Yeah they should. Just get ready for some arguments about people who don't know the replacements are rolling out yet. ",
    "type": "comment",
    "score": 6,
    "subjectivity": 0.5,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7usjq9",
    "text_content": "I don't think anyone has made decisions for that yet. But assumedly, if the number of exploding Note7s drastically decline (I.e. the recall is successful) the ban should be off...\n\nDon't bet on your replacement unit being exempt from the get-go... How would a flight attendant know the difference between a \"dangerous\" Note7 and a completely safe new one?",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.6409090909090909,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7usg4s",
    "text_content": "Probably yeah. But they're gonna wait a while until they're sure that most ppl have their replacements.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.6944444444444444,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7wd7ku",
    "text_content": "Korean Airlines have started allowing new issue-free Note 7 to be used. I think you just need the latest software update with green battery icon as proof.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.5515151515151515,
    "include_for_labeling": "Y"
  },
  {
    "id": "520fec",
    "text_content": "Any info yet on when replacement Note 7 units hit stores? I'd like to exchange my phone, but I hate to be without it.",
    "type": "post",
    "score": 2,
    "subjectivity": 0.9,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7gczjp",
    "text_content": "Yeah I'm wondering the latest news as well. I saw a reddit post that the CPC or whatever acronym representing the government just got involved and they control when replacement phones can be shipped?\n\nBe nice to get samsung to divulge the details instead of getting a ton of random spam from crappy tech websites. \n\nThey can't afford to wait 4 months to simply give me a safe model phone. Would hurt the company and make Americans even more upset with government sticking their nose where they don't need to.\n\nSheesh ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.6261904761904762,
    "include_for_labeling": "Y"
  },
  {
    "id": "50csgl",
    "text_content": "Note 7 Boot-Loops and Restarts Becoming an Issue",
    "type": "post",
    "score": 4,
    "subjectivity": 0.85,
    "include_for_labeling": "Y"
  },
  {
    "id": "d73318p",
    "text_content": "I just got off the phone getting a 2nd replacement Note 7! [First one](https://www.reddit.com/r/samsung/comments/4ypre9/note_7_random_reboot/) was randomly freezing & rebooting. The new one is so much worse. Any time I try to do anything on the phone it locks up & reboots not saving a dam thing. Driving me crazy. The representative I talked to first said I was the 3rd person to call about this today. This is crazy!",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.4468013468013468,
    "include_for_labeling": "Y"
  },
  {
    "id": "56tf2m",
    "text_content": "Should i just get a different phone? I love my note 7, i waited to Upgrade because i didn't like the 5 and i was still rocking a 3. However hearing that the replacements are blowing up is extremely annoying.. should i just wait it out for yet another replacement? Or just got for the pixel?  Or is there any other phone with a stylus like the s pen i should go for?",
    "type": "post",
    "score": 7,
    "subjectivity": 0.619,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8md7eo",
    "text_content": "Nobody here has really answered your question because it's really a matter of opinion at this point. Personally I think it's sad. I feel for Samsung right now. Other posts say that Samsung doesn't care about their customers, but I think this shows that they actually care quite a bit. They're doing what they can to fix the issue, even if they aren't getting it right the first, or second time, they're trying and it's not like this is a result of poor decision making, or a matter of cutting costs or anything. They simply tried to launch a flagship phone that had unexpected battery issues. They tried to fix it and had issues again. It's pretty sad, and Samsung is going to feel the hit; if they haven't already. \n\nAs for other phones with a stylus, the LG Stylo phones do, but I can't comment on their performance or what the experience is like because I've only owned Samsung android phones. I'd check them out in person and see what you think, look at some online reviews, and go with your gut at this point. \n\nIf it says anything, I'm still on my Note 4 and was really anticipating the Note 7. I haven't switched yet because of these safety issues, but that's just my take. ",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.5269423558897243,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8mpk1g",
    "text_content": "I rocked the note 3 for about a year and a half. The gps stopped working 6 months ago and left me stranded, but the phone was paid off so I refused to let me give up the phone. 3 months ago the camera started acting up and every picture started becoming wavy, soon the camera wouldnt focus. a week before matthew was set to hit my area head on, it stopped connecting to data networks and mobile connection was dismal. Now my fiances note 5, is having connection issues and keeps dropping data connection until the phone is restarted. Similar case with another family members S4 which recently started having data connection issues. \n\nThis leaves me weary of samsung devices, it seems to far off from coincidence that 3 devices would start acting up in a similar matter. It swayed my decision away from another samsung device. Seeing that they push a new model every year now shows me they are no longer seeking longevity of the devices they offer. The note 7 fiasco is just another nail. Its a shame, Loved the note 3, even on dated software and hardware it was a capable device. Reluctantly I took an upgrade to the LG G5 as I needed a reliable phone asap before Hurricane Matthew hit.\n\nAs for the stylus? Its a cool feature, but why not get a dedicated tablet with a stylus so you can achieve greater potential out of it, then just opt for a phone with good specs? The pixel certainly seems like a solid choice for an upgrade.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.4523689273689274,
    "include_for_labeling": "Y"
  }
]