[
  {
    "id": "5b420k",
    "title": "S-Pen Replacement Denied: Last straw for Samsung",
    "selftext": "So this weekend, my girlfriend's S-Pen came apart when she tried to pop it out of the phone. \n\n[Here's a picture of it after we managed to get the other end out](http://i.imgur.com/ya7DlLD.jpg)\n\nLooks like the little black glue holding the halves together simply wore out after a year or so. I touched the glue and it barely had any adhesive quality left to it. \n\nYou'd think this would be simple call in for a replacement, right?\n\nHahaha, no. \n\nFirst, I contacted them through chat. Twice. The second time I actually got up to a supervisor, but they all said that since *I had broken the pen* it wasn't covered under warranty. Now you can see in that picture that the pen is in pristine condition. No scratches, no scuffs, no cracks, just separated. This phone has never come close to being abused or even used roughly. \n\nBoth chats I told the system to send me a transcript of, but for some 'unknown' reason they never arrived. \n\nAfter going through 3 people on the normal route, I go to social media, namely Facebook and Twitter. I get the same response back on those. *I* broke the pen and so it's not going to be replaced, but they're more than happy to forward me to their store where I can buy another one. \n\nI should not have to spend $35 to replace a broken piece of my phone that broke on its own during normal use (I actually went to a 3rd party seller on Amazon and paid only $20). \n\nYou'd think after the massive shitshow with the Note 7, they'd be willing to absorb $35 (on a product that probably cost $5 to make, if that) to make a customer happy, but apparently not. \n\nMy girlfriend had every Note except the Note 7 (the recall started before our upgrade window came up), but after what happened with it and how they continually dismissed us over a *freaking pen*, she's not getting the 8. \n\nThanks, Samsung. \n",
    "author": "Computermaster",
    "created_utc": 1478271902.0,
    "created_date": "2016-11-04 23:05:02",
    "score": 2,
    "num_comments": 10,
    "url": "https://www.reddit.com/r/samsung/comments/5b420k/spen_replacement_denied_last_straw_for_samsung/",
    "subreddit": "samsung",
    "search_query": "Note 7 recall",
    "subjectivity": 0.417,
    "post_type": "opinion",
    "extracted_comments": [
      {
        "comment_id": "d9llyx7",
        "comment_text": "So instead of fixing it with a dab of super glue you go through all that AND $20? Wow. Good for you. ",
        "comment_score": 11,
        "comment_author": "Lonelycub",
        "comment_subjectivity": 0.7555555555555555
      },
      {
        "comment_id": "d9lkif6",
        "comment_text": "How long is your warranty?",
        "comment_score": 1,
        "comment_author": "Mister_Kurtz",
        "comment_subjectivity": 0.4
      },
      {
        "comment_id": "d9m0sut",
        "comment_text": "If you are not satisfied with their customer service you should never buy their product again.",
        "comment_score": 1,
        "comment_author": "kdcurry",
        "comment_subjectivity": 1.0
      }
    ],
    "num_extracted_comments": 3
  }
]