[
  {
    "id": "56xuku",
    "text_content": "How big is the difference between the Note 7 and the S7 Edge? I'm really disappointed that I will have to once again trade in my Note 7, but unfortunately this time I have to actually get something different. I'm most likely going to be getting the S7 Edge and am looking for input on it. \n\nI already know it doesn't explode or catch fire, but otherwise where did you notice the differences between the two?",
    "type": "post",
    "score": 7,
    "subjectivity": 0.579,
    "include_for_labeling": "N"
  },
  {
    "id": "d8oesdb",
    "text_content": "the ui is different. kinda sucks. feels cheaper. no pen. slightly smaller screen. i just got one today for my note 7. :( over not a bad phone.\n\nbetter battery",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.5944444444444444,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8np5ba",
    "text_content": "Here is a great website where you can compare up to 3 phones at a time to check their specs.  http://www.gsmarena.com/compare.php3?&idPhone1=8082&idPhone2=7945&idPhone3=7821",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.75,
    "include_for_labeling": "N"
  },
  {
    "id": "d8nremd",
    "text_content": "have note 7 and tried s7e in order to replace it with note 7 . tbh note 7 is better than the s7e , and u will feel the differ if u came from note 7 to s7e , if u want safety get s7e , if u want the best phone in the market then note 7. however i noticed diffrences in the main ui and the fast the note 7 deals with apps , note 7 is alot faster than s7e , i didnt try the camera, i dont use it anyways , but obv better , aside from that i didnt notice anything cuz i only used note 7 for 2 days and s7e for 10 minutes ,so i cant say for sure. \n\nEDIT: i forgot to mention that but i got addicted to note 7 iris scanner lol :P very fast and easy ,only downside it doesnt work on direct sunlight . it works ok in dark areas.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.6459722222222223,
    "include_for_labeling": "Y"
  },
  {
    "id": "56zmln",
    "text_content": "[Other]To Samsung From a Note 7 User Dear Samsung, \n\nI'm sorry you are having a bad day/month/year. I have to say it is with reluctance that I am giving up my Note 7. I love the phone. It has everything I want from a phone. Not only does it look gorgeous and feel smooth and solid, but it has the specs that to match its smooth exterior. It is the Mercedes of phones. \n\nI have had my Note 7 since day 1, I preordered it the day it was announced and picked it up on release day. I was so excited I annoyed the hell out of my fiancee. All I talked about for days was my phone. I even took they day off of work to be home for the delivery of my Gear VR 2.0. \n\nSpeaking of the VR experience, it was amazing. Not only did the headset fit my giant size 8.5 head, it was comfortable. I played for hours. I'm going to miss it. \n\nI'm frustrated right now because I don't know what phone to get. I don't want the S7 because I will be stuck in it for the next 2 years, and the S7 is already out dated. I've been looking at the Pixel XL, but it doesn't have the smooth rounded finish of my Note 7, nor the pen, or the SD card slot, or even my iris unlock. Maybe I'll just keep my Note 3. \n\nI wish you luck. I hope that we can meet up again in two years.",
    "type": "post",
    "score": 115,
    "subjectivity": 0.64,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8nxym6",
    "text_content": "So beautiful, I think my eyes are leaking...",
    "type": "comment",
    "score": 20,
    "subjectivity": 1.0,
    "include_for_labeling": "N"
  },
  {
    "id": "d8o1jue",
    "text_content": " I already switched back to my note 3. There's just nothing out there that I want right now especially after owning a note 7 for two months. It is so good that I'm still willing to use and own it if they could guarantee it will not catch fire.\n\nThe curved and rounded edges felt much better in my hand than any other phone. I hope Samsung doesn't axe the look and feel of the phone because it was great. If they came out with note replacement that is just different hardware stuffed into the note 7 skeleton I would buy it after waiting to see if it spontaneously combusts or not (sorry Samsung, but trust was lost).\n\nI might make another post depending on how the refund situation turns out. I got my phone through my carrier and it doesn't really make sense that I have to wait for Samsung to refund me instead of my carrier. Mail sucks where I live so this whole get a box in the mail to return it thing will likely turn into another fiasco for me.",
    "type": "comment",
    "score": 6,
    "subjectivity": 0.6123949579831933,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8o39k7",
    "text_content": "I agree with you, Although I have a note 5 which I'm surprised to say I'm decently content with.... \n\nI finally got the wife to upgrade from her s4 and she's absolutely gutted, she wants her note 7 back in a bad way, and the s7 edge doesn't really cut it, So I'm in the same place, might end up giving the kids an s7 edge when there's a note 7 replacement. ",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.5064814814814815,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8o30lz",
    "text_content": "I share your sentiments exactly. Nothing out there is as good as the note 7 was, so I'm just going to hold onto my s6 edge. If the S8 impresses me I'll probably buy one of those, although I will miss the S pen.\n\nIt's just a waiting game now.",
    "type": "comment",
    "score": 5,
    "subjectivity": 0.4166666666666667,
    "include_for_labeling": "N"
  },
  {
    "id": "57bovt",
    "text_content": "Survey says 40% current Note 7 users will never buy another Samsung phone",
    "type": "post",
    "score": 41,
    "subjectivity": 0.4,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8r4cec",
    "text_content": "These survey don't mean shit when you're only surveying a very small percentage of Note 7 owners. ",
    "type": "comment",
    "score": 17,
    "subjectivity": 0.751875,
    "include_for_labeling": "N"
  },
  {
    "id": "d8qv6ak",
    "text_content": "I don't buy it. 90% of Note 7 owners got replacement Note 7s with the first recall.\n\nAnd your title is wrong. The online survey was done among Samsung phone owners, not Note 7 owners. It likely captures a bunch of clueless consumers who don't actually have Samsung phones.",
    "type": "comment",
    "score": 22,
    "subjectivity": 0.5833333333333334,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8qtduv",
    "text_content": "I can't say never, but I'll definitely be taking a break from Samsung with the Pixel XL. Maybe in a year or two I'll reevaluate after I see how Samsung has handled things, and what direction Google is headed with their project.",
    "type": "comment",
    "score": 4,
    "subjectivity": 0.5,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8rgmb8",
    "text_content": "Pixel isn't the only option...... S7 Edge.",
    "type": "comment",
    "score": 1,
    "subjectivity": 1.0,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8rmdfi",
    "text_content": "There's a difference between what someone says in a survey during a period of heightened negativity towards Samsung and what they do in a year or two when they release a new phone that everyone is raving about.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.45454545454545453,
    "include_for_labeling": "Y"
  },
  {
    "id": "4yjc0i",
    "text_content": "Note 7 owners?? How do you like it so far? Wondering how you folks who got it so far are feeling about it.",
    "type": "post",
    "score": 12,
    "subjectivity": 1.0,
    "include_for_labeling": "N"
  },
  {
    "id": "d6o66l3",
    "text_content": "So far I'm loving the phone. The only gripe I have at the moment is the box it arrived in... Unfortunately I am an AT&T customer and it shipped in a very flimsy box with zero protection. A couple of the items were not in their little cutouts (including the phone) when I opened it. ",
    "type": "comment",
    "score": 6,
    "subjectivity": 0.7916666666666666,
    "include_for_labeling": "N"
  },
  {
    "id": "d6o71al",
    "text_content": "I got it yesterday. I love it except for the fact that the S-Pen's clicker sticks to the pen. If the pen doesn't click, it won't eject and it gets stuck inside the phone.\n\nI don't know what to do. Should I contact Samsung?",
    "type": "comment",
    "score": 5,
    "subjectivity": 0.6,
    "include_for_labeling": "N"
  },
  {
    "id": "d6ob95h",
    "text_content": "Hey bud, my note 7 came in yesterday and it's even better than i expected. The iris scanner worked so smoothly the s pen ia great, camera is great, the overall feel and look of the phone is crisp and clean.",
    "type": "comment",
    "score": 4,
    "subjectivity": 0.5020833333333333,
    "include_for_labeling": "N"
  },
  {
    "id": "d6onsnd",
    "text_content": "Stopped by the Verizon store to pick one up this morning and am blown away by everything. And this is coming from someone who came from a Galaxy S7. My only gripe at the moment is the back light bleeding around the edges near where the glass meets the aluminum frame. Maybe this will fix itself in a few days but if not, then just going to get a replacement.",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.44000000000000006,
    "include_for_labeling": "N"
  },
  {
    "id": "d6phlke",
    "text_content": "It's gorgeous. I came from an LGK10 so this is quite the upgrade. Accessories should be here soon from Amazon. I love this phone. Just worried about features I'm not taking advantage of.",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.75,
    "include_for_labeling": "N"
  },
  {
    "id": "d6q9pk3",
    "text_content": "I received mine on Thursday, (a day before launch day)! At first I want horribly impressed with it, just looked and felt much smaller then my Note 5 (only had that for about three weeks, had the LG V10 before it). After using it for a day I quickly started changing my mind and felt more and more excited about it. I have realized this isn't the Note 5, this is much better Samsung really improved upon itself and developed something that feels solid and fluid it really seems to work the way a smart phone should. I thought I was going to hate the curved edges, on the Note 5 when I would use my right hand svc tried to click on something on the top left side of the screen, the inner side of my hand would click on an app on the lower right side of the screen. It hasn't happened with the Note 7 yet (I am over 6 feet tall so I have pretty big hands). The way screen folds over on the sides really does make watching videos on it that much better. The side panel shortcuts are really nice, the flashlight actually has a brightness level for it, instead of just on or off. The S Pen works really well, like using a sharp pointy pen! It does feel heavier than the Note 5, so you definitely know you're holding onto to something. It feels like it's the size of a galaxy S7 , but when compared to the Note 5 the screen viewing seems larger! Even though sized up the screens are exactly the same size! Oh and the camera, wow it takes some really great photos, I have had a couple of people that own an IPhone (6S+ to be exact), and they could believe how incredibly sharp the pictures looked, the camera on the Note 7 is amazing! Your gonna love it! Oh I had one minor problem, I put the SD card into the slot of my phone with no issues, with my wife's phone it took me a few tries to get it into the tray and slide it into the phone. The SD card kept sliding back in the tray when I slid it into the phone. I had to in the end press on the back of the card as I was sliding it in it was tricky but I was able to get it in there. That's all hope you get yours soon, this is in my book the best smart piggie on the market today!",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.4688988095238095,
    "include_for_labeling": "N"
  },
  {
    "id": "d6o5iq3",
    "text_content": "When I get my Note 7 today and give you my first impressions...As it's on the delivery truck as I type, waiting for my loving hands!",
    "type": "comment",
    "score": 5,
    "subjectivity": 0.6416666666666666,
    "include_for_labeling": "N"
  },
  {
    "id": "d6o8koc",
    "text_content": "love the phone, i'm painting and drawing is my passion and to find out that the pen is 4k pressure level is absolutely a godsend. overall, best phone thus far. i ditched my nexus 5x for this.",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.5599999999999999,
    "include_for_labeling": "N"
  },
  {
    "id": "d6o9h4l",
    "text_content": "I love my Note 7. Was first inline at sprint this morning and ive been using it non stop! easily the best phone I have had. Everything is perfect with it and I also bought an otterbox for it. Very sturdy and feels nice in the hand.",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.6238095238095237,
    "include_for_labeling": "N"
  },
  {
    "id": "4xngca",
    "text_content": "S7 Edge or Note 7? I'm getting a phone within this week. :) (HOORAY) I know the significant spec bump the N7 brings to the table, but my question is if it's worth the extra time + money for it. The edge and the note both has the same promotions. (prob picking up a gear with it)\n\nCurrently, I don't have a phone so getting it asap is kinda important for me. I'm currently rooting for the edge as I'm planning to go to Best Buy today or the day after, but is the note really worth waiting for the 19th? The Note is tempting, but I would really like to have a phone in my hands. Is there any way to get it before the 19th? \n\nI'm on VZW btw, and currently planning to sign a 2-yr contract.\nCheers!\n\nhttp://www.bestbuy.com/site/featured-offers/mobile-phone-cell-phone-sale/pcmcat125500050005.c?id=pcmcat125500050005",
    "type": "post",
    "score": 29,
    "subjectivity": 0.417,
    "include_for_labeling": "N"
  },
  {
    "id": "d6gwauj",
    "text_content": "I would probably wait on for the note 7 if it was me. If you really feel that you don't need the S pen or don't have any interest in it than the S7 edge is a fantastic choice. ",
    "type": "comment",
    "score": 11,
    "subjectivity": 0.55,
    "include_for_labeling": "N"
  },
  {
    "id": "d6gze5x",
    "text_content": "I would do the Note in all honesty. Its still an amazing phone. \n\nHowever, I have to wait til September to get mine. I have a striking feeling they may come up with a more advanced version with how they are currently in other countries. So the wait may be worth it, but you need it now. \n\nIf I were you, I would figure out what I want and what the most important things are in a phone you want. Then check off any pros and cons with each version until you settle with what has the better features for you. I feel the Note 7 will offer more, especially with the extra features it has. Plus if you make a habit out of using the pen, you may grow addicted to using it. I forced myself to use it after not using it for a year. That whole year I feel like I missed out on it's full potential and ever since, I have never gone a day without using the pen. Its incredibly useful for what I do, and I don't think I could be any more efficient with an S-series phone than the Notes. Especially with how much they expanded on the pen features, I am excited to get the N7.",
    "type": "comment",
    "score": 4,
    "subjectivity": 0.5579545454545454,
    "include_for_labeling": "N"
  },
  {
    "id": "d6hifut",
    "text_content": "Don't buy the S7 or S7 edge, this expensive piece of shit it's broken and samsung won't acknowledge it. \n\nI experienced this problem on the first couple of weeks when I got it and nor samsung or the retail seller will acknowledge [THEIR ERROR.](http://forums.androidcentral.com/samsung-galaxy-s7-edge/685025-darker-translucent-lines-when-i-change-brightness-my-galaxy-s7-edge.html)",
    "type": "comment",
    "score": -5,
    "subjectivity": 0.6266666666666667,
    "include_for_labeling": "N"
  },
  {
    "id": "4xaln8",
    "text_content": "Note 7 has poor rAM managment as well.. Basically someone's already done a speed test vs Iphone 6s, and guess what ?Note 7 had to reload almost every app during the multitasking part, and if you look at comments a lot of people are saying that it's due to Note 7's resolution being much higher, but no, resolution has nothing to do with app launching/loading, only the RAM and memory matter in this test, and while loading times don't bother me, the poor ram managment makes me have second thoughts about the phone. How can they still have this piss poor ram managment when they're so far in the game ?\n\nP.S. This is the Exynos variant, the uploader says so in the comments.\n\nhttps://www.youtube.com/watch?v=p2xSS45Ld1o&ab_channel=C4ETech",
    "type": "post",
    "score": 14,
    "subjectivity": 0.564,
    "include_for_labeling": "N"
  },
  {
    "id": "d6e0pzj",
    "text_content": "Op, I don't think you fully understand. Resolution IS taking a portion of the cpu / GPU that the iphone6 doesn't have to worry about. The resolution being around 25% higher makes it much more harder of a task to render these apps. The iPhone has an advantage of being lower resolution. Think of a pc game playing at 720p and then running it 1080p and then 1440p. You're going to see differences in loading and rendering times without a doubt. Not sure why you're convinced the resolution plays no part, that's just wrong. ",
    "type": "comment",
    "score": 23,
    "subjectivity": 0.5314814814814814,
    "include_for_labeling": "N"
  },
  {
    "id": "d6e5ljq",
    "text_content": "So your saying a program that is written to benchmark Apple products doesn't properly benchmark a Samsung product? Go ahead and try to argue the whole IOS and Android app thing, and you'll be wrong because Apple holds everything from it's hardware to the software that it runs on. Samsung makes the hardware and then adds it's own flavor to the software that Google maintains. Completely different it isn't an Apples to Apples comparison. Try comparing it to another Android phone instead you'd be allot closer! Dang 8 years and we are still having this argument. ",
    "type": "comment",
    "score": 8,
    "subjectivity": 0.6,
    "include_for_labeling": "N"
  },
  {
    "id": "d6eh2yp",
    "text_content": "Ah yes, for all the times I want to open and then immediately close all of the apps on my homescreen.",
    "type": "comment",
    "score": 6,
    "subjectivity": 0.5,
    "include_for_labeling": "N"
  },
  {
    "id": "d6dy0e9",
    "text_content": "Strange, my S7 edge is pretty snappy when it comes to multitasking. \n\n",
    "type": "comment",
    "score": 7,
    "subjectivity": 0.575,
    "include_for_labeling": "N"
  },
  {
    "id": "d6ecrff",
    "text_content": "This submission has been randomly featured in /r/serendipity, a bot-driven subreddit discovery engine. More here: https://www.reddit.com/r/Serendipity/comments/4xcsa1/note_7_has_poor_ram_managment_as_well_xpost_from/",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.5,
    "include_for_labeling": "N"
  },
  {
    "id": "d6e1d72",
    "text_content": "Speed tests are only important to enthusiast.  It's only \"bad ram management\" to people looking up these super specific circumstances about a phone they are possibly hyped about. It's interesting but should be taken with a grain of salt and not \"labeled bad ram management\". \n\nApple nor Samsung get on stage at press events and show how fast someone can switch apps like a spaz to show how cool their phone is.\n\nIf it was beneficial Apple would certainly do it no phone maker does this because only a minority care about it.",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.7266483516483516,
    "include_for_labeling": "N"
  },
  {
    "id": "4z4d9j",
    "text_content": "Switching from Iphone 6s to Note 7 Never have I owned a Samsung phone, had a iphone since the iphone 4s. After seeing the note 7, and hearing that the iphone 7 wont be having a headphone jack, Ive made up my mind to switch. Only thing Im scared of is I heard samsung devices dont age well, Ive heard they slow down over time. I was wondering why samsung devices slow down over time and iphones stay fast and lag free over the years? Shouldnt samsungs stay faster since they have more ram and more cores?",
    "type": "post",
    "score": 19,
    "subjectivity": 0.531,
    "include_for_labeling": "N"
  },
  {
    "id": "d6syf2f",
    "text_content": "Note 4 user here. Note 4 still runs amazingly well for its age. Feels like it just came right of the box. Here's the thing, you have to get used to the Android system. We don't have imessage. Which really sucks cause imessage is far superior to the regular SMS system. If you head over to /r/Android youll see what I mean. If you don't live is the US forget what I just said. Anyway Samsung has been doing a great job of improving your devices performance after major updates in my opinion. The problem is that take an eternity to release. It's even worse on carrier phones.  So what I like to do to keep my phone fast is factory reset my phone before and after an update. So make sure to backup. Many people have issues with their battery life and performance after an update. Factory resetting usually fixes the problem. Second, wipe the dalvic cache if you're having any performance related issues. I usually never have to do this. Don't download any apps that you dont need or never going to use. Some of them just run in the background and waste your battery life. \n\nDisable apps you don't need. Apps like Facebook just drain your battery. You can get package disabler pro which is amazing if you know how to use it correctly. Search threads on what apps to disable. Disabling too many can ruin your battery.\n\nAlso get used to the TouchWiz launcher and see if you like it. Fyi users have reported that the launcher can cause some stuttering in the home menu but idk if it's true or not. If you don't like the TouchWiz launcher you could get nova launcher. It allows extreme customization that you'll never get with iOS. Go to /r/androidthemes.\n\nThe things I mentioned might sound really overwhelming but it's really not. in fact many people don't even do any of those things I mentioned and they're fine. I've always loved Android due to its customizability and it's \"freedom\". It allows you to do so much more things than an iOS device. Both have many pros and cons. Youll have to explore a bit to get the best experience in android while in iOS it's easy to use right out of the box. It's up to what you prefer. I tried to cover as many things as I can but I'm in a rush so pm me if you need any help \n\nEdit: I forgot to answer your last question. More cores and ram doesn't always mean faster. The guy below me is right when he says ios is more optimized than android. Apple only has to make software for a couple devices. All devices that were made by then. iPads iPods iPhones. No one else makes them besides them. They control what goes in to the products. So of course the software is going to optimized to run on that hardware. Really optimized. Compare that to how android has to rub on thousands of different devices from different manufacturers. Unless if all android phones ran the same hardware, it would be extremely hard to optimize android for all devices. iPhones also have nvme storage which is extremely fast compared to even the UFS storage Samsung uses, which is also faster than the average phone. The simple reason is that Apple can afford to make it while the other companies can't. The A9 processor is simply really fast. Still love android and the note series tho",
    "type": "comment",
    "score": 12,
    "subjectivity": 0.5268257423917803,
    "include_for_labeling": "N"
  },
  {
    "id": "d6t05gs",
    "text_content": "You have to take care of your phone. Delete old stuff and try different apps that can clean your phone deep inside. It's just like a PC. What happens if your PC is full of shit? Anyway if you do it weekly then you dont have to worry about it :)",
    "type": "comment",
    "score": 5,
    "subjectivity": 0.6071428571428571,
    "include_for_labeling": "N"
  },
  {
    "id": "d6t3eaw",
    "text_content": "Having owned Samsungs since the first galaxy, I can tell you that I've only had issues with one and that was the s3 and that was my fault. I dropped it 3 times (not in a row) down iron bark stairs. After a while it just stopped working. This was around the time the s5 came out and I bought an s5 not long after. \n\nI've now moved onto the s7 edge, but my s5 is onto a new owner and still working fine. Owning a samsung is like owning a desktop. You have to care for it, delete old shit, watch out for nasty surprises, and keep the skin flicks to a minimum. ",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.5529741863075197,
    "include_for_labeling": "N"
  },
  {
    "id": "d6t5xi9",
    "text_content": "https://www.youtube.com/watch?v=3-61FFoJFy0\n\nWatch this.\n\nAt the end of the day, it will come down to your preferences, stylus, iris scanner and stuff like that are all great.\n\nWhere as iPhone has the iOS eco system etc. Hey Siri. Force touch.",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.5194444444444445,
    "include_for_labeling": "N"
  },
  {
    "id": "d6sy5so",
    "text_content": "I went a little crazy with my switching\nFirst ever IPhone 3GS - iPhone 4s-galaxy s4- iPhone 6-iPhone 6s -galaxy s7 edge- note 7-iPhone 7??\nGalaxy phones are \"slower\" by random freezes where it barely happens on iPhones but still happens, but i feel like iPhones became slower over time, every iPhone I have I get tired of and feel like upgrading to a newer one or a new phone, but switching to iPhones doesn't make knowing what the next feature is but because it's the latest iPhone. Idk\n",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.4875420875420875,
    "include_for_labeling": "N"
  },
  {
    "id": "d6taizm",
    "text_content": "I am amazed about how the headphone jack wont make you buy the iphone 7. You still didn't see what apple has to say about this. it might be because the phone became waterproof so the headphone jack could be replaced with different earphones. Don't be so negative before the iphone 7's release ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.5,
    "include_for_labeling": "N"
  },
  {
    "id": "d6tc5h7",
    "text_content": "I'm moving on from my 6s plus to a note 7. That screen and camera and no bezels got me, I'll navigate android just fine I think. Plus I need to break free of the apple ecosystem now or I never will. IMO the note 7 is everything the iPhone plus should be but instead we just got an iPhone with a bigger screen, that's all. I've been using iOS 10 since the first public beta and right now on the 6th it's pretty much solid and smooth and it does nothing of any significance for me",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.4817460317460317,
    "include_for_labeling": "N"
  },
  {
    "id": "d6td2yg",
    "text_content": "My Note 4 was great and aged amazing. The only drawback was battery, it would reach a certain point and then jump to very low numbers. Like it would go to 20 or 24 and drop to either 0 or 8. Could be the battery or I could have damaged something with leaving it someplace hot because that seems to be the case with battery issues I've seen.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.6944897959183672,
    "include_for_labeling": "N"
  },
  {
    "id": "d6tots0",
    "text_content": "Not sure why you'd want to drop so far down in performance but to each their own I suppose!",
    "type": "comment",
    "score": 0,
    "subjectivity": 0.7944444444444444,
    "include_for_labeling": "N"
  },
  {
    "id": "4yinee",
    "text_content": "Getting my new Note 7 today after having iPhone for 7 years, need some help I ordered the phone from Verizon and FedEx is bringing it by today. I want to keep my contacts, don't care about the apps though and all my pictures are already backed up... I am not sure if I switch SIM cards (VZW is CDMA so i think I can't do that???) or if i do some voodoo magic by connecting the two phones... Any help would be really appreciated, really pumped to get something other then Apple but i know it will be a learning curve.",
    "type": "post",
    "score": 27,
    "subjectivity": 0.503,
    "include_for_labeling": "N"
  },
  {
    "id": "d6nyua6",
    "text_content": "There is an adaptor that is included with the Galaxies called an OTG connector, attach that to your phone and plug your iPhone into it. Then download Samsung smart switch from google play and you are good to transfer your old data!",
    "type": "comment",
    "score": 11,
    "subjectivity": 0.48095238095238096,
    "include_for_labeling": "N"
  },
  {
    "id": "d6nztht",
    "text_content": "[I would follow this site](https://www.android.com/switch/). Makes things very easy, and you'll be guided all the way through.\n\nDon't forget to turn off iMessage!",
    "type": "comment",
    "score": 4,
    "subjectivity": 1.0,
    "include_for_labeling": "N"
  },
  {
    "id": "d6nyyj0",
    "text_content": "Android phones like the Samsung Note will use your Google Contacts by default.\n\nIs your iPhone synced with your Google Contacts? If so, your new Android phone will have all your contacts right away.\n\nIf not, look up how to sync your iPhone with Google.",
    "type": "comment",
    "score": 4,
    "subjectivity": 0.4951298701298701,
    "include_for_labeling": "N"
  },
  {
    "id": "d6o5uep",
    "text_content": "I'm right there with you! Kicking the iPhone after 6 1/2 years. I pre-ordered the blue coral from Bestbuy and they said maybe not today though :(",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.5452380952380952,
    "include_for_labeling": "N"
  },
  {
    "id": "d6ooqrh",
    "text_content": "You will get one big shock with that Verizon version. Start with ugly Verizon logo, their bloat all over (can be disabled), modified firmware. It's unfortunate iOS converts can't experience a good Android experience without carrier intervention. Hate Samsung for not releasing unlocked US version at launch.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.65,
    "include_for_labeling": "N"
  },
  {
    "id": "d6or2o7",
    "text_content": "Please update us and let us know how the change is. Im looking to get a note as well but am having separation anxiety about leaving my iPhone lol",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.7,
    "include_for_labeling": "N"
  },
  {
    "id": "d6oraxr",
    "text_content": "Off topic, but can I ask the reason behind the switch?\n\nFrom personal use, Samsung Smart Switch works best. Easy to use as well.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.5552380952380952,
    "include_for_labeling": "N"
  },
  {
    "id": "d6p8l1y",
    "text_content": "Download Nova launcher for even more customisation",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.5,
    "include_for_labeling": "N"
  },
  {
    "id": "4wja94",
    "text_content": "Note 7... go naked or use a case? With the gorilla glass 5 & all that, who's going naked with their Note 7? Or do you still think a case is still a mandatory thing?",
    "type": "post",
    "score": 4,
    "subjectivity": 0.4,
    "include_for_labeling": "N"
  },
  {
    "id": "d67g7ix",
    "text_content": "for me cases serve the dual purpose of protecting the phone and also making it easier to hold, especially when it comes to texting ",
    "type": "comment",
    "score": 10,
    "subjectivity": 1.0,
    "include_for_labeling": "N"
  },
  {
    "id": "d67fuwi",
    "text_content": "I'm getting a spigen thin case ",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.8500000000000001,
    "include_for_labeling": "N"
  },
  {
    "id": "d67o03h",
    "text_content": "I never sell my phones, so I don't care about a few scratches here and there.\n\nI'm paying for a premium product, with incredible attention to detail in terms of design and materials... I dont want to shit on that with a cheap $10 case? If it breaks it breaks.\n\n\n\n",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.625,
    "include_for_labeling": "N"
  },
  {
    "id": "d67h22z",
    "text_content": "I'd go no case. Part of what you pay for with these devices is the appealing design, so covering it up with a ten dollar piece of rubber seems counter intuitive.\n\nWith that said, I have a couple clear cases that I throw on my S7 Edge when I go to the gym. I like to have one when I think there's a higher chance of it being dropped, then tsake it off for the rewst of the day.\n\nYou could also get a DBrand skin. They look great IMO and do help to protect from scratches.",
    "type": "comment",
    "score": 4,
    "subjectivity": 0.42666666666666664,
    "include_for_labeling": "N"
  },
  {
    "id": "d67h1er",
    "text_content": "I'm getting a case because I don't like going naked on my devices...I prefer to protect them from accidental little scratches and make them easier to hold. As I am going to preorder via T-Mobile and pay it off using the Jump on Demand program...I don't want to damage the device unnecessarily in case the phone gets dropped by accident. Also there are some fairly nice cases out there that don't add a significant amount of bulk. The one for my Note 5 is still fits well in the pocket and looks good.",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.7125,
    "include_for_labeling": "N"
  },
  {
    "id": "d67sfc6",
    "text_content": "As clumsy as I am I always go otterbox defender. Carpal tunnel can make you drop little things at random times. I don't know if my Note 4 would have made it a week without one. Sometimes my phone goes flying out my hands at random times and I really can't help it. ",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.42000000000000004,
    "include_for_labeling": "N"
  },
  {
    "id": "d67xw9i",
    "text_content": "I cannot recommend Spigen brand cases enough and right now on Amazon they are half off...regular 25 on sale for 11.99. \n\nThe build quality is excellent...the button integration is precise. I've used other cases that either make the phone bulkier or have poor quality materials or shite craftsmanship. \n\nGet a spigen...you'll love it.",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.5110544217687075,
    "include_for_labeling": "N"
  },
  {
    "id": "53r85e",
    "text_content": "Anyone else surprised Samsung isn't doing some sort of promotion to help bring people back to the Note 7 now after this problem?",
    "type": "post",
    "score": 17,
    "subjectivity": 0.45,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7vmnz2",
    "text_content": "I'm going from Note 7 to Note 7, I want a free Gear VR.",
    "type": "comment",
    "score": 12,
    "subjectivity": 0.8,
    "include_for_labeling": "N"
  },
  {
    "id": "d7w520a",
    "text_content": "I bought the Note 4 on 9/25/2014, the first day it was available. \n\nI'm not eligible for the Note 7 until 9/25/2016\n\nSo I've been watching in amazement as everything had gone down. They'll have to offer some kind of promo to get new people buying again. They won't want to, it'll cost a lot more money, but as with the recall cost, it'll be a lot more expensive long term if they don't. ",
    "type": "comment",
    "score": 5,
    "subjectivity": 0.49741863075196413,
    "include_for_labeling": "N"
  },
  {
    "id": "d7vs5km",
    "text_content": "Finally got my my new Note 7 today and im honestly so glad this whole ordeal is over for me\n\nWould be cool if they hooked us up with something for sticking by them but I wouldn't expect them too or be upset if they didnt",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.7009090909090909,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7vzixk",
    "text_content": "Not really, when i was talking to samsung support about getting compensation for the whole debacle, they kept trying to explain how they are replacing the phone \"with a brand new phone\" for *free* as if that was like some special deal i'm getting. ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.48519480519480523,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7w3cxt",
    "text_content": "unwritten entertain employ wrench existence spotted possessive yoke bored exultant\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
    "type": "comment",
    "score": 1,
    "subjectivity": 1.0,
    "include_for_labeling": "N"
  },
  {
    "id": "514dca",
    "text_content": "Anyone keeping their Note 7 until the replacement is offered? So I ordered my Note 7 from AT&T. Is anyone just going to wait until they start offering the Note 7 as a direct replacement before exchanging it? The risk of explosion should be pretty damn low, right?",
    "type": "post",
    "score": 25,
    "subjectivity": 0.559,
    "include_for_labeling": "Y"
  },
  {
    "id": "d797lym",
    "text_content": "Keeping it until Samsung sends replacement. Love this phone. Cold as cucumber while charging. No worries here.",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.8,
    "include_for_labeling": "Y"
  },
  {
    "id": "d79rzxa",
    "text_content": "Mine went into a boot loop while charging after it got really hot last night.  I had to trade it in today and got a S7 Edge...I was going to hold out but it forced my hand.  :\\  I can't wait to get another Note 7.",
    "type": "comment",
    "score": 4,
    "subjectivity": 0.5291666666666667,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7986k8",
    "text_content": "I'm actually returning mine and will be waiting for the cheaper refurbished handsets to hit the market and just re-purchase it.\n\nMy phone gets hot though",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.47500000000000003,
    "include_for_labeling": "Y"
  },
  {
    "id": "5ihexe",
    "text_content": "Samsung Smart TV Ads - Filing FTC Complaint I've been an unhappy owner of both a Samsung refrigerator and their S5 and S6 phones. I reluctantly bought one of their SmartTvs in August, and yesterday, the TV displayed a message saying that the Smart Apps (Netflix, Amazon Video, YouTube, etc.) were disabled because the \"Terms of Service\" have changed. After contacting tech support, I was told there was nothing I could do about it, either accept the ads or lose the functionality.\n\n\nAll of the Samsung devices I mentioned above have had major problems at different times, the latest S7 (Which I didn't buy) explodes, as do their clothes washers. The lack of quality and customer service for their products at this point is just stunning.\nI took what I think is my only option and today filed an FTC complaint and would encourage all of you to do so (they told me each person must file an individual complaint). Here is how (with an edited version of my own complaint):\nGo to the FTC Complaint Assistant at:\nhttps://www.ftccomplaintassistant.gov/#&panel1-1\nSelect \"Other\", and then \"No Match Found\" (you may have to select \"Click for more options\" and then file your complaint. Here is mine:\n\n\nIn August of this year, I purchased a Samsung UN55KU6290FXZA television. This is typically an expensive unit and is well reviewed and considered high quality. A major reason for buying it was due to it having Samsung “Smart Apps” – different mini applications you install and run on directly on the TV to access services like Netflix and Amazon video. When I shopped the TV, the only information about Smart Apps relevant to this complaint is that an internet connection is required.\nI installed and setup the TV, and was forced to sign up for a Samsung account in order to use the Smart Apps, which I did. Things were fine until a few weeks ago when I noticed a new Smart App appear on the television that I didn’t choose or install. I thought that was strange, but yesterday when I turned the TV on, a diagnostic message appeared saying that there was a change in the “Terms of Service” and I had to accept it in order to keep using Smart Apps – and this change included my agreement to accept internet ads. I declined that acceptance (this was an option on the screen), and sure enough, my Smart Apps were no longer available. I immediately contacted Samsung technical support who told me that they just made the change and are within their rights to turn off television features if I don’t accept new terms of service. When I purchased this unit, there was no mention on the Samsung Site (http://www.samsung.com/us/televisions-home-theater/tvs/4k-uhd-tvs/55-class-ku6290-6-series-4k-uhd-tv-2016-model-un55ku6290fxza/) or the Amazon sales page that accepting or viewing any sort of advertisements (pushed by Samsung or anyone else) was required to use the features of the TV. Even the screenshots of the feature being used do not show ads. I do not believe it is fair or legal to pay money for a product, and then have the producer remotely decided to either charge you money or force you to see ads (which makes them more money) – and then literally disable features on your device when you refuse. Please contact Samsung and force them to stop this practice.\nSincerely,",
    "type": "post",
    "score": 6,
    "subjectivity": 0.504,
    "include_for_labeling": "N"
  },
  {
    "id": "db869j0",
    "text_content": "The best thing you can do is just buy a cheap streamer for $20 like a Fire stick or $99 for an AppleTV or Roku. \n\nThen never buy another Samsung product again. That's the only way to hurt them.\n\nThis is why you need to buy products from morally sound companies. Samsung is morally corrupt. Sorry, have to say it. When your CEO is a two time felon, what do you expect?",
    "type": "comment",
    "score": 5,
    "subjectivity": 0.7333333333333334,
    "include_for_labeling": "N"
  },
  {
    "id": "db8ax6z",
    "text_content": "I have the same exact issue.  \n\nI AM SO UPSET RIGHT NOW.\n\nMy Samsung TV KS8000 did an update last night.  I wanted to make a change to my picture settings and I was locked out of all my settings.  The only thing that popped up was this message asking me to opt in to \" Interest Based Advertisements\".  I refused it because I did not want it.   Since I refused it - it asked me again - over and over for me to to opt in.   I SAID NO!!!!!! Samsung should know what \"NO\" means.  I DONT WANT IT!  And then they LOCK ME OUT OF MY TV controls because I refused that crap!? \nI do NOT want to opt into your bullshit advertisements.   This is total crap!!  I will be reporting them to the BBB for this.\n\nWhat is Samsung doing?   They ruin my Note 7, My Samsung fridge was a lemon after 3 months and I had my washer and dryer recalled.  The only thing I trusted was their TV's but now this BS.  I give up on Samsung completely.  My TV is now sitting in my living room with no access to its TV controls because I refuse to opt into their \" Interest based Advertisements\".\n",
    "type": "comment",
    "score": 6,
    "subjectivity": 0.5727380952380953,
    "include_for_labeling": "N"
  },
  {
    "id": "db8ye7t",
    "text_content": "This just happened to me as well.  Can't believe this is even allowed.  Thankfully I just got a 4K capable Roku, but I like watching Netflix on there.  I'll probably end up doing what you suggested in another comment about resetting everything.  Hope this gets resolved",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.4,
    "include_for_labeling": "N"
  },
  {
    "id": "db90ewt",
    "text_content": "Lol lookup slingbox lately? Pos,s",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.6499999999999999,
    "include_for_labeling": "N"
  },
  {
    "id": "dbp44cc",
    "text_content": "I just got a 649D Samsung and I am utterly stupefied that I cannot turn off ads in the source hub! Soooo pissed right now. Literally unable to believe they did this. I will be telling any and all loudly and often NOT TO BUY SAMSUNG TV's unless they want to be served up ads on a daily basis. I filed a complaint, of course I expect them to tell me to pound nails.\n",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.5059523809523809,
    "include_for_labeling": "N"
  },
  {
    "id": "db8cwx3",
    "text_content": "Samsung smart apps is a service they provide.  They are well within their right to do this.  Companies are about maximizing profit.  They just had one of the worst years in history.  They need to make cash to keep the share holders invested.",
    "type": "comment",
    "score": -1,
    "subjectivity": 0.7261904761904763,
    "include_for_labeling": "N"
  },
  {
    "id": "51spra",
    "text_content": "[HELP] - Can I/Should I still buy the Note 7? I switched to Samsung just prior to the Note 4 coming out for a variety of reasons, a significant one being the Gear VR's release.  I've loved every minute of having this phone and the Gear has been even better than I hoped it would be.  The Note 7 uses the new charging port, and has an updated Gear VR for it, which I'd love to get my hands on.  I know about the exploding battery thing, but I'm guessing that I should be able to (at some point, at least, if not now) get a \"fixed\" version of the phone.  Has that happened?  Anything else I should be considering?",
    "type": "post",
    "score": 4,
    "subjectivity": 0.495,
    "include_for_labeling": "N"
  },
  {
    "id": "d7eldji",
    "text_content": "No, the phone is not currently available anywhere. I don't expect it to go down in price either, because that would be rather insulting to those who paid full price and had to deal with an exchange.\n\nI expect they'll be available for orders again within the next couple weeks, and then begin shipping in a few weeks. I'll actually be getting one myself once they become available. Not sure if I want black or titanium though...",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.4146464646464647,
    "include_for_labeling": "N"
  },
  {
    "id": "d7elwfw",
    "text_content": "I just came from a Note 4 and I can say that the Note 7 is very worth the upgrade it seems like its better in every way and it has a great feel to it. ",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.45999999999999996,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7eshrv",
    "text_content": "I have a note 7, I love it so much I'm gonna exchange mine for another note 7 when they are available. ",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.4000000000000001,
    "include_for_labeling": ""
  },
  {
    "id": "51zjp7",
    "text_content": "[Help] Upgrading from Apple to Samsung so i've finally decided to upgrade to an Android phone after having iPhones for 4 years. my upgrade is in January so i have a bit of time to decide \n\n\n i don't know a whole lot about androids but i was looking into Samsung and i really liked the Note 7. aside from the new issue of it exploding (hopefully that's completely fixed before January), it looks like a really cool phone. \n\ndoes anyone have any advice for other phones i should look into? thank you in advance!",
    "type": "post",
    "score": 2,
    "subjectivity": 0.554,
    "include_for_labeling": "N"
  },
  {
    "id": "d7g9yzf",
    "text_content": "My s7 edge is the best phone I have ever owned. Sleek, beautifully designed, Battery life is fantastic, stability no problems at all and best if all I can slap a micro SD card in and listen through MY choice of headphones. Oh and finger print recognition is flawless too.  Apple should be worried.   I'm not into the while apple are crap android are crap.  I vote with my money and the s7 edge so far is a premier phone.",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.7625,
    "include_for_labeling": "N"
  },
  {
    "id": "d7g7k80",
    "text_content": "Any specific reasons you are switching away from iPhones? Samsung phones are pretty much hit or miss as far as quality goes. You may like your phone in the first few weeks, but all the little issues will start to pile on and the phone will not feel so premium. ",
    "type": "comment",
    "score": -5,
    "subjectivity": 0.46547619047619054,
    "include_for_labeling": "N"
  },
  {
    "id": "52euhy",
    "text_content": "Gear S3 Compatibility? While I wait on an official price from Samsung (and to see if it'll explode and blast my wrist to bits), I was wondering what level of compatibility the Gear S3 will have with other Android devices. I used to own a Gear 2 Neo, but that device only worked with Samsung devices. If the Gear S3 has full or near-full compatibility with other non-Samsung Android phones, I'll go for it.\n\nBy full compatibility, I define that as all features being able to sync with any Android phone, like fitness tracking, taking/making calls, music control, messaging, notifications, etc. If the Gear S3 ticks most of these boxes, I'll give it a look.",
    "type": "post",
    "score": 4,
    "subjectivity": 0.622,
    "include_for_labeling": "N"
  },
  {
    "id": "d7jwtzx",
    "text_content": "In my understanding you just download the gear app from Playstore, and it'll work just like it works with Samsung phones. I'm not sure if Tizen has any apps for other activity tracker software than S-health. That might be a problem. Does anyone have any experience with this issue? \n\nps. The S3 will work with the iPhone too.",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.6319444444444444,
    "include_for_labeling": "N"
  },
  {
    "id": "5b420k",
    "text_content": "S-Pen Replacement Denied: Last straw for Samsung So this weekend, my girlfriend's S-Pen came apart when she tried to pop it out of the phone. \n\n[Here's a picture of it after we managed to get the other end out](http://i.imgur.com/ya7DlLD.jpg)\n\nLooks like the little black glue holding the halves together simply wore out after a year or so. I touched the glue and it barely had any adhesive quality left to it. \n\nYou'd think this would be simple call in for a replacement, right?\n\nHahaha, no. \n\nFirst, I contacted them through chat. Twice. The second time I actually got up to a supervisor, but they all said that since *I had broken the pen* it wasn't covered under warranty. Now you can see in that picture that the pen is in pristine condition. No scratches, no scuffs, no cracks, just separated. This phone has never come close to being abused or even used roughly. \n\nBoth chats I told the system to send me a transcript of, but for some 'unknown' reason they never arrived. \n\nAfter going through 3 people on the normal route, I go to social media, namely Facebook and Twitter. I get the same response back on those. *I* broke the pen and so it's not going to be replaced, but they're more than happy to forward me to their store where I can buy another one. \n\nI should not have to spend $35 to replace a broken piece of my phone that broke on its own during normal use (I actually went to a 3rd party seller on Amazon and paid only $20). \n\nYou'd think after the massive shitshow with the Note 7, they'd be willing to absorb $35 (on a product that probably cost $5 to make, if that) to make a customer happy, but apparently not. \n\nMy girlfriend had every Note except the Note 7 (the recall started before our upgrade window came up), but after what happened with it and how they continually dismissed us over a *freaking pen*, she's not getting the 8. \n\nThanks, Samsung.",
    "type": "post",
    "score": 2,
    "subjectivity": 0.417,
    "include_for_labeling": "N"
  },
  {
    "id": "d9llyx7",
    "text_content": "So instead of fixing it with a dab of super glue you go through all that AND $20? Wow. Good for you. ",
    "type": "comment",
    "score": 11,
    "subjectivity": 0.7555555555555555,
    "include_for_labeling": "N"
  },
  {
    "id": "d9lkif6",
    "text_content": "How long is your warranty?",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.4,
    "include_for_labeling": "N"
  },
  {
    "id": "d9m0sut",
    "text_content": "If you are not satisfied with their customer service you should never buy their product again.",
    "type": "comment",
    "score": 1,
    "subjectivity": 1.0,
    "include_for_labeling": "N"
  }
]