[
  {
    "id": "4vjxjb",
    "text_content": "If Note 7 Rumors are true, isn't s7 edge better? Hi all,\n\nAs the title suggests...\n\nThe Note 7 is rumored to be 5.7\" (0.2\" larger than S7E), with a smaller batter (3,500mAh v 3,600mAh). AND it's rumored to have identical RAM, processor, waterproofing, camera etc to the S7 and S7E.\n\nAm I right in thinking that the only advantage the Note 7 has over the S7E is a larger screen, an iris scanner (gimmicky idea, doubt it will be used more than fingerprints) and the stylus?\n\nThis phone will be 5 months older than the S7/S7E, with virtually identical specs, as well as a (presumably) higher price tag than the S7E.\n\nOr am I missing something??",
    "type": "post",
    "score": 39,
    "subjectivity": 0.506,
    "include_for_labeling": "N"
  },
  {
    "id": "d5z259v",
    "text_content": "Don't discount the iris scanner. Gimmicky for average Joe consumer... But in the enterprise and byod space... Could be game changer. ",
    "type": "comment",
    "score": 6,
    "subjectivity": 0.4333333333333333,
    "include_for_labeling": "N"
  },
  {
    "id": "d60c6w0",
    "text_content": "The s-pen is huge. I was able to use a demo note at verizon for about a half hour the other day and am sold for that reason. Being able to annotate things and all of the functionality it has is very useful, even for the short time I had used it. Sold on the note, I am now an ex-iPhone user!!!",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.4273809523809523,
    "include_for_labeling": "N"
  },
  {
    "id": "d5z2pnq",
    "text_content": "if the iris scanner works well id love it. i have a surface pro 4 and using windows hello to unlock my computer is so convenient. i assume the new finger print scanner will be better but i HATED the finger print scanner on the note 4. it did not work well for me at all, i ended up going back to my old iphone 5s (which I luckily did not sell yet) and decided to wait until the note 7 (note 5 was out but i wanted micro sd). \n\nthe s pen is very important to me too, if it didn't have the s pen i would just get an s8 (not buying a new phone unless it has usb c at this point). ",
    "type": "comment",
    "score": 5,
    "subjectivity": 0.5269360269360269,
    "include_for_labeling": "N"
  },
  {
    "id": "d5zk07l",
    "text_content": "> and the stylus?\n\nHave you heavily used a Note phone before? The s-pen is way more than a stylus. It brings a whole ton of functionality that a normal stylus couldn't do. Additionally, Samsung is basically saying \"We're basically taking the best phone there is, making the screen a little bigger, and adding the s-pen.\" I'm sold on that alone. I went from the S4 to the Note 4 to the Note 5 to the S7e, and as awesome as the S7e is, I prefer the Note 5 over it, because of the s-pen. I used it all the time at work, and without, I just feel naked. ",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.5277777777777778,
    "include_for_labeling": "N"
  },
  {
    "id": "d5zd2xm",
    "text_content": "I have heard so many rumors. Why do you think those ones are true? ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.575,
    "include_for_labeling": "N"
  },
  {
    "id": "4wvn6s",
    "text_content": "Huge pre-order numbers mean Samsung can taste success with the Galaxy Note 7",
    "type": "post",
    "score": 51,
    "subjectivity": 0.529,
    "include_for_labeling": "N"
  },
  {
    "id": "d6aa9tm",
    "text_content": "This is great news. I was personally hugely disappointed when I heard that the Note 7 isn't going to come with a non edge display, but seeing as to how people react to the edge variant... I'm quite intrigued.\n\nJust to be 100% sure I'm not making a mistake, I'm waiting to see the Note 7 in person and I might just buy it on the spot.",
    "type": "comment",
    "score": 11,
    "subjectivity": 0.7962962962962963,
    "include_for_labeling": "N"
  },
  {
    "id": "d6ayar8",
    "text_content": "As I only have a 5 I'm so excited for this.  A usable pen in a powerful and compact little device.  Can't wait!",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.8125,
    "include_for_labeling": "N"
  },
  {
    "id": "d6df37i",
    "text_content": "I am happy that I preordered this device, while I love my Note 5 I feel that the software and S pen tweaks that the Note 7 has are certainly worth the upgrade to the device. As I have Jump on Demand, I'll be paying it off over the course of 18 months. Since my Note 5 is in pristine condition, that will allot me some nice credit towards paying off the Note 7.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.675,
    "include_for_labeling": "N"
  },
  {
    "id": "d6axfj3",
    "text_content": "This cannot be a good thing.  This mean Samsung will continue to sell overprice phones if this trend continue.  ",
    "type": "comment",
    "score": -6,
    "subjectivity": 0.64375,
    "include_for_labeling": "N"
  },
  {
    "id": "4x2azp",
    "text_content": "Note 7 Display Gets Record High Max Brightness",
    "type": "post",
    "score": 30,
    "subjectivity": 0.54,
    "include_for_labeling": "N"
  },
  {
    "id": "d6ctix2",
    "text_content": "Does anyone know how the speaker sound ? Looked for a review everywhere ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.4,
    "include_for_labeling": "N"
  },
  {
    "id": "d6d4ky9",
    "text_content": "I was just wondering if it's better than the iPhone 7 speakers cause I'm debating between either phone ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.5,
    "include_for_labeling": "N"
  },
  {
    "id": "4vu8ni",
    "text_content": "News: Samsung Galaxy Note 7 goes official with USB Type-C, iris scanner, water-resistant body and more",
    "type": "post",
    "score": 20,
    "subjectivity": 0.5,
    "include_for_labeling": "N"
  },
  {
    "id": "d6255sn",
    "text_content": "I would not use this phone for work.  Really would not use the pen either. More for casual use. Should I just get the s7e?",
    "type": "comment",
    "score": 0,
    "subjectivity": 0.5222222222222223,
    "include_for_labeling": "N"
  },
  {
    "id": "4xw4gs",
    "text_content": "Galaxy Note 7: Is the S-Pen the biggest selling point? I have a phone upgrade available this Friday, so I have the choice between the S7 Edge and the Note 7. Personally, I don't know how much I'd use the S-Pen (I've never really used a stylus besides my 3ds). \n\nFrom what I've read, the S-Pen is the only major upgrade besides the larger screen. Should I get the Edge for the better battery life/cheaper price? Or should I get the Note because it's the newest toy on the market?",
    "type": "post",
    "score": 11,
    "subjectivity": 0.45,
    "include_for_labeling": "N"
  },
  {
    "id": "d6iwhyy",
    "text_content": "S-Pen is mostly the defining feature of the Note line now. It used to get the latest tech, but there is no latest tech yet to put in the phone so it's mostly a side-grade from the S7E in terms of specs. The S-Pen is pretty fantastic and I don't even use it daily, or even weekly sometimes, but ones you get used to having it, it's tough to go without. \n\nNote is the newest toy so it has newer software features and some pretty neat tech that the S7E doesn't have such as 4x4 MIMO",
    "type": "comment",
    "score": 12,
    "subjectivity": 0.7033333333333334,
    "include_for_labeling": "N"
  },
  {
    "id": "d6j5k5b",
    "text_content": "I've used the Note 3 for 2 years now and really didn't know how I was going to function without an S-Pen. It is not for everyone, and not even used every day, but smart select is AMAZING for sharing clips of webpages. I store a lot of info in action memos, and the ability to quickly sketch something out with higher precision than my fingers is definitely worth it IMO.",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.42040816326530617,
    "include_for_labeling": "N"
  },
  {
    "id": "d6jankk",
    "text_content": "I believe the best selling point is how it looks, damn does it look good.",
    "type": "comment",
    "score": 4,
    "subjectivity": 0.45000000000000007,
    "include_for_labeling": "N"
  },
  {
    "id": "d6j2cco",
    "text_content": "Back the with the Note 2 it was the superior screen size and battery. Also the bigger ram and higher clocked cpu were additional reasons for me to get one. The Spen wasn't that important. \n\n",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.58,
    "include_for_labeling": "N"
  },
  {
    "id": "d6jfufw",
    "text_content": "I've never had or even used any of the Note's but honestly the S pen is one of the features that has me ready to part with $1200+can.",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.7,
    "include_for_labeling": "N"
  },
  {
    "id": "d6k301b",
    "text_content": "It's one of the biggest selling points, but not the biggest. I'm glad Samsung finally fixed it so you couldn't slide the S-Pen in backwards anymore. I have the Note 4 (personal use) and the Note 5 for work. I love both of them, but I would give the nod to my Note 4 since it has the memory card slot and IR Blaster which I don't use too often. My gf is upgrading her phone this week, and she's getting the Note 7. She has the Galaxy S5 so it'll be a huge upgrade for her. The inclusion of the 256Gb MicroSD card was icing on the cake.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.6,
    "include_for_labeling": "N"
  },
  {
    "id": "51af8t",
    "text_content": "How to return your Note 7 to AT&T I work closely with AT&T and saw their internal communications on the matter so here's what's up:\n\nIdeally, return it to the store you got it from or the closest store to you.  However, if you tell them you can't make it to a store they *will* process the return over the phone and will actually have you hold onto the phone until they send you return instructions (not available as of yet)\n\nThey will replace the phone with literally anything.  The communication says to push for other Samsung products, but they are allowed to replace it with any phone, so if you want to take this opportunity to try out something different, then you are welcome to.\n\nOf course, this is all just if you got your phone through AT&T and not through a 3rd party or Samsung.\n\nTL;DR:  Go to a store or call and say you can't get to a store.  Choose your own replacement",
    "type": "post",
    "score": 24,
    "subjectivity": 0.486,
    "include_for_labeling": "N"
  },
  {
    "id": "d7bmvkm",
    "text_content": "From my experience returning my Note 7 at the AT&T store. It was a pretty cut dry process, was immediately offered to get a loaner Galaxy device until the new Note 7 became available but instead I opt'd for a full refund (includes the sales taxes and any payment made if on Next). I'm opting to pre-order the iPhone 7 once it becomes available because although I love all what the Note 7 had to offer, the battery life and daily usage performance drove me up the wall.\n\nThe cool thing of all this is keeping the promos you may have gotten with the note 7 purchase, in my case I did the buy one get one free and chose an s7 edge for my backup phone line. The credits for that phone will still apply even if I dont stick with a galaxy device on my main line (plus the 2x 256 microSD promo cards I've already received)",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.4823232323232323,
    "include_for_labeling": "N"
  },
  {
    "id": "d7aubyq",
    "text_content": "The 25 credit is only exchange for Samsung phone",
    "type": "comment",
    "score": 2,
    "subjectivity": 1.0,
    "include_for_labeling": "N"
  },
  {
    "id": "d7apmlg",
    "text_content": "So I could try out the iPhone 7 if all this shit isn't figured out by then? ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.8,
    "include_for_labeling": "N"
  },
  {
    "id": "4wuua9",
    "text_content": "Special Version Of Galaxy Note 7 Confirmed By A Dealer In China. Few days ago, SAMSUNG just updated its Galaxy Note 7 official record on China's Ministry of Industry and Information Technology's website. Based on the record, we can see the a special version with 6GB + 128GB will be released. Yesterday, there is a dealer in China also exposed the price and release date of Galaxy Note 7 in China.\n\nFrom the information we have, the special version is only for China. The price of the normal version is CNY5688 (~USD853), the special version is CNY6088(~USD913). SAMSUNG and other official dealers will accept pre-order on Aug 28th and it will be released on Sep 2nd.\n\nThat dealer also said, the Google already optimized Android for 6GB RAM version Galaxy Note 7 and it will be released with the phone.\n\nWe don't know the exact model of the special version right now, but we can see there is a SM-N9300, which is the model of normal version, on Geekbench's website with 6GB RAM.",
    "type": "post",
    "score": 5,
    "subjectivity": 0.53,
    "include_for_labeling": "N"
  },
  {
    "id": "d6a7q02",
    "text_content": "MASSIVE RIOT INCOMING! Snapdragon 820 or Exynos",
    "type": "comment",
    "score": 1,
    "subjectivity": 1.0,
    "include_for_labeling": "N"
  },
  {
    "id": "4w9nli",
    "text_content": "china will have a new galaxy note 7 edition with 6GB RAM and 128GB ROM. I just checked China's Minister of Industry and Information Technology's website, Samsung has updated their official record, it says there will be a new edition of Note 7 with 6GB RAM and 128GB ROM. Not sure if the CPU will be changed, also. I tried to google something, but nothing helped me know if it's for China only. I hope Samsung will also release this model to other countries. I am considering stopping pre-order Note 7 but waiting for some news.",
    "type": "post",
    "score": 21,
    "subjectivity": 0.635,
    "include_for_labeling": "N"
  },
  {
    "id": "d65ajri",
    "text_content": "Seems pretty pointless to have an upgraded version so soon. I think i'm gonna have to hold out to see if they really will have an upgraded version",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.5666666666666667,
    "include_for_labeling": "N"
  },
  {
    "id": "d66qnn7",
    "text_content": "Samsung is gonna shoot themselves in the foot here. Either lose the Chinese market to iPhone 7, or give them a note7s before iPhone releases and have a lot of angry people everywhere else who should have had access to the note 7s",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.5,
    "include_for_labeling": "N"
  },
  {
    "id": "52scvp",
    "text_content": "Note 7 T-Mobile Experience and Exchange [Rant] I want to begin by saying I'm a long time supporter of Samsung and their products. From TV's, washing machines, dishwashers, fridges, cords,headsets, and phones I have always stood by them. I am a registered Platinum Member in fact and I just want to make it clear I'm not bashing them in anyway and think they are handling this as best as they can however it is quite a shit show. \n\n(Feel free to go down to the exchange heading if you are only interested in that however I'd appreciate your time)\n\n\n* **Purchasing**\n\nI purchased the phone day 2 in store (using Tmobiles old jump program as Im grandfathered into it) and was told it was gonna be mailed as it was out of stock in store. I had travel planned at the end of the coming week and wanted to have the phone for it. In the store I was told 4 business days tops and since it was a Friday and I wasn't leaving until the following Friday that I'd be fine. Trusting in this I opted against going and buying it outright somewhere else and having to deal with activating it. I checked my Tmobile account daily starting Saturday where I saw it said my note 5 was my \"trade device\" and then there was just nothing under the \"new device\" tab. I wasn't concerned figuring it had just went through no big deal. Sunday- nothing no change. Monday-no change and I was at this point figuring the site must have a bug and just not show it. Now I waited until Wednesday to check again seeing then that still no progress had been made. I had received an email the day prior with a tracking number but when I looked it up USPS said nothing was found. So now Thursday morning I decide that there must be a problem as nothing had changed. \n\nSo I call in and the rep asks me for my account info and upon pulling it up she too cant see anything for my new device. She is apologetic but after 15minutes of her trying to get into the account she gives up and says she'll need her supervisor. I wait another 10 minutes and she comes back and says she still wasnt able to totally open the account however she can track it and says its at my local post office and out to be delivered. Great! I thank her and hangup. Where I live they don't deliver mail so when mail is being delivered it just means they are sorting it to your box so I head down to the post office.  I know the postman well and he says he hasn't got anything for me and checks the whole data base and nothing comes up.  So now I'm showing him the tracking number in the email tmobile sent me and he immediately sees that for whatever reason they doubled the numbers up and thats why it wasnt working so he checks the number and is able to tell me that not only have they not shipped it but not even gave it to USPS all they have done it print a label. So I return home and call again to find out why they told me it was shipped. The gentlemen I speak with tells me he's sorry and has no idea where this other agent got this info from. On top of that he's sorry to say that it wont probably ship for a few days still as its back ordered. I ask why no one told me and just get more sorrys. So fast forward to 3 days later I return and finally have the device.\n\n\n* **Ownership**\n\nNow once I got it I had a little problem transferring my old data using the included connector and cord. Ended up using the old wireless system and synced quickly. Now I had no problems from here on out other than I noticed it got quite warm but I use fast charge battery packs as I'm on the go often so whatever I think nothing of it as my note 3 got warm way back when it had just came out. \n\nFast forward to D-Day its top news every where that note 7's are bursting into flames. Shit. So I now begin to only charge while I'm watching it and in a metal bin whatever not a big deal however whats the plan what am I to do with the other 2 million people. \n\nI get that answer days later when a message is given that all retailers are gonna be issuing some sort of return process and give a loaner phone. Eh well okay at least they are taking care of me. Well not really days go by and I hear what some carriers are doing but nothing from T-Mobile hell not even an email from them that I have a recalled piece of equipment that is a possible hazard to my health. \n\nFinally I get an email from them that says I have 3 options. 1.sign up to be told when the new phone is ready 2.Switch to a new device totally forever or 3.Return for full refund\n\nI call in to see if I can exchange like I heard other carriers are doing for just a loaner phone. I'm given a resounding NO that I'd be at that point choosing option 3 and returning and that I'd be getting the loaner phone on my own dime and I could just hope that within the 14 day return period that I'd be able to get a new note 7. Ha no way. I'll just be careful with the phone. Now almost a week passes and I got the text from yesterday saying that now they are really gonna take care of me. This is quotation directly from the page.....\n\n\"We’re making it easy for you to exchange your Galaxy Note7 for free.\n\nJust head into one of our retail stores to exchange your device. We’ll take care of the rest. Or you can call us today at 1-844-275-9309. We’ll ship you any device of your choice in our inventory with free next business day shipping. You can keep it or use it as a “loaner” until the new Note7 is available.\"\n\nIf it looks to good to be true...\n\n* **Exchange**\n\nSo after my past experiences there is no way in hell I'm calling in when I'm given the option to handle this in the store as they tend to be a lot more accountable when we are face to face. So I go in and have a group ahead of me in line browsing the store so I sit down on the side and wait. The female rep asks if anyone is here to pay a bill or anything like that, that'll be quick I say yeah I'm just here to exchange for my loaner phone from the note 7 program. She is visibly displeased and lets me know that its a 30 minute process. I say okay thats fine I can wait to which she says well the last one took 45 minutes I say okay thats still fine I can wait. 15 minutes pass and a manager comes from the back letting me know I need to just call in to handle this as the store isnt capable and hands me a paper with the number written down. I let him know that the message I received from T-Mobile said quite the opposite to which he says there is no way he can exchange it in store as the hotline has the only system that allows the process and tells me he's sorry but over the past few days they tried to do it in store and simply couldn't as they don't even have the stock of s7/s7 edges to give out loaner phones.\n\nI finish my errands return home and immediately call and get quickly connected to Amy. Amy is quite chipper and lets me know the process is quite simple and all I need to do is head in the store and I'll be taken care of with an exchange loaner device of my choice. I laugh and let her know what I was told and she becomes concerned and says there is no way that could have happened as, as soon as the store sees a note 7 they are too immediately exchange  for any device even if all they have is Iphones as its considered a liability and safety concern. So I tell her then please note this information exactly on my account and I'll head back in. She notes it all with policy numbers even and I drive back.\n\nUpon arriving the store is armed with different employees from earlier except the female rep running the counter. She immediately goes in the back bringing a new manager who asks me, \"How can I help you?\" I tell him the situation and how I was already here and he says that the number I was given is the only thing he can do to help me. I explain that this is not the case and that I have notes on my account that should explain it clearly. He checks and says that this is old information and is not what his District Officer advised him on. He offers I call from the store phone and just try again. I oblige and speak with John. John tells me within 30 seconds that I can just head into a store to get my loaner. I ask him if he could hold for just one moment and tell that to the T-Mobile manager sitting across from me. They now I kid you not go back and forth for 15minutes telling each other different policys and how each other are wrong. I'm nearly laughing at the ridiculousness of the situation as 2 reps of the same company tell each they don't know policy. He eventually hangs up and tells me he is sorry but these guys on the phone don't know what they are talking about as there \"system doesn't just have a magic loaner button\". I tell him I understand but what am I to do as I'm just getting the run around no matter what I do. He says the main problem is, that my note 7 when I got it had a tax charge as all things do when they leave the store. He says that there is no way for me to get a tax charge in there system therefore he cant give me anything as thatd be illegal. I tell him that I understand the predicament but uhh what do I do? He then tells me he's gonna try a few things with his other employee. They spend 20 minutes and get no where. He then says he is trying to contact the District Officer or someone higher up but it could take a while. Sure why not I can wait. 45 minutes go by and still nothing. Now they are just trying different things in the system and finally come up with a way to get me a new device. However its gonna use an upgrade and also is outside the \"hotline loaner program\" therefore I'm now not entitled to a note 7 when they come out but he says he can make it note but its not legally binding and he cant promise anything. Yeah no way so he says just try and call in again tonight. \n\nI leave defeated and as I'm driving home I pass Verizon. Out of curiosity I pull over and look up the location and call them. I speak with John and ask him what is the process for the note 7 debacle. He is very friendly and says that for now all his location is doing is giving full refunds and thats it. I come clean and tell him I'm not with Verizon but T-Mobile and tell him my situation. He asks which location did I go too. I tell him and sure enough he says he used to work there and that they are know as the \"idiots of the district who always call in and end up just throwing there hands in the air and give up\" Wow great. He then in detail explains to me what they should have done in the system as he knows it well when he worked there and I tell him the problem with taxes to which he replies should be a non problem as when they refund the first note 7 I should get a credit for the original tax. Nevertheless he tells me to go to this other T-Mobile location he was at and gives me employee names to speak with. I thank him and return home.\n\nNow I decide I'll attempt this hotline one final time. Dana picks up and listens to it all and says she is sorry I'm going through this and can't believe the disconnect from the stores and hotline. She though is able to actually send me a loaner over the phone and works with me to get all the info. She asks what phone I want to which I decide why not try an Iphone 6s+ as I havent had an Iphone since the original 5. So she confirms it all and I think back to a problem I've had in the past when I moved a few months ago. There was a wrong street number which I had called and had \"fixed\" twice in the past so I ask her what address she is sending to and of course its wrong. Jesus Christ, I tell her its wrong and she corrects it and the call concludes telling me to sign my EIP when it comes to my email. \n\nFINALLY this nightmare is over.... right? Well 2 hours pass and I get the email and sign it. And its now almost midnight, what a day. I get the final confirmation email and read it over. Yep you know it guess what was wrong??? The address. Still. Wrong. \n\n**(I actually started writing this post at this point but got even more content to write lol)\n**\nI'm now finally at my wits end, I've kept calm all day and been very understanding but now I'm pretty sure I'm gonna have a heart attack. I call its 12:02am and I speak with Ieasha who hears a very abbreviated gloss over the situation to which I tell her I just need the address fixed on my current shipment. Guess what no she cant. Once the EIP is signed it cant be canceled. She tries for 20minutes and has me explain the whole situation. She then says shes gonna have me talk to a supervisor who she has explained how crazy this has gotten. \n\nKendall the head supervisor is now talking to me who says she is gonna put this to bed no matter what it takes right here and now. I tell her that this is my last call to T-Mobile as otherwise I will be going in and demanding full refunds and canceling my 5 year long account with them. I let her know the entire problem and go into detail with the exact disconnects I see between the stores and hotline. I tell her about how I had them even arguing over the phone on what policy was. I conclude the story with telling her that as the customer I have done my due diligence and that this is in her hands to get higher ups to hopefully fix this nightmare of a system. She admits her displeasure with how ridiculous this all is and even laughed at how stupid this must look. She reiterates that she cant cancel this order at this point and has tried. However she is gonna just credit me the entire cost of the Iphone and send it free. Even going as far as to sends case and screen protectors. She asks that I please call in the morning using Dana's direct line and have her deal with calling UPS to stop the shipment when they get it. She says that she'll not be working for 2 days but will make sure that its all dealt with when shes back to be sure there are no problems. She says to also hold my note 7 as collateral until they send me a note 7 in the future which they should call about in the coming weeks.  I thank her and finally set down my phone. \n\nIts 1am and I have two 800 dollar iphones, case, and screen protectors coming and it only costed me about 7 hours of calls and sitting in the store, a few gallons of gas, and about 98% of my patience.\n\nMorning comes and I call Dana's line as soon as she is supposed to be on duty as I have her hours for the next few days written down. No pickup. I call a few times over the next couple hours and finally decide to just call the note 7 hotline again and the rep sees the note on my account and says she will deal with UPS. \n\nSo that's it not too bad right? I hope my slightly ticked demeanor is understood but this was the craziest experience in recalls I have ever dealt with. Worse than car recalls where I have had family get free cars worth over 20k once all was said and done. I write this to vent and also get the word out that there is a clear problem at T-Mobile that hopefully Kendall gets the word out about. I just want to make sure no one else deals with this and has better experiences. \n\nMy final words are gonna be some lessons learned about this process:\n\n* **DO NOT LET ANYONE HAVE YOUR NOTE 7 wait until you have the new one confirmed being shipped to you or are being handed it in the store.**\n\n* **Do not go into the store they can NOT help you and dont become upset with them for this as they simply lack the system to do so.**\n\n* **Lastly document everything. Who you speak with. Where you go. Whats happening even. Its the best way to cover yourself as this process is being developed.**\n\nI now am just waiting for my Iphone and hoping that it all works out and I dont end up getting charged anything after this all but I'm sure this story will only get crazier when its time to get my  replacement. We shall see. \n\nThanks for your time.\n\n**TLDR: Read the last bold area and don't try to go exchange in store!\n**\n\n*Also I'm not reading this twice so expect grammatical errors, understand I'm pretty over dealing with this anymore. :)*",
    "type": "post",
    "score": 22,
    "subjectivity": 0.498,
    "include_for_labeling": "N"
  },
  {
    "id": "d7nj49w",
    "text_content": "I had a similar experience with what to do with my phone with Jump on Demand. Phone rep told me to go in store, store people said I Was nuts. They just have a disconnect there, but they're still better than all the other carriers. ",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.425,
    "include_for_labeling": "N"
  },
  {
    "id": "d7njrpr",
    "text_content": "My SO and I are having the same problems with t-mobile. Gotta be sure your dealing with a Corp owned store. My first problem was going into a t-mobile independently owned store. They are the absolute worst in service and complete assholes. \n\nI've been calling t-mobile over 9 times, my boyfriend has 3 times. We went to one location, the shitty one, then the good store. It took over 3 hours for the two stores and we were almost late for work. We now have loaner phones we had to pay taxes for and yesterday a t-mobile phone support was going to call me back to order our new phones the iPhone 7 plus. Our bill is over $700. We're stuck with \"free tablets\" because the shitty store pressured us to get them. Then after signing the papers, he tells us there's a $75 restocking fee for each tablet. Loyalty dept won't take back the free tablets cause their not technically accessories but they are since you can't get them without ordering a note 7. And our note 7's could have blow out our eyes cause the phone got fucking hot using it with a gear vr. \n\nI don't know what to do anymore. It's been so stressful with everything. Now I'm afraid these s7 loaners are somehow gonna be our upgrades and we won't get the actual phone we want. \n\nWe've been with t-mobile for 4 yrs. We're thinking of selling everything that has a line (phones, tablets, smart watch, ue boom, and ipad) and buying I phones through apple instead. I'm so tired of t-mobile so called support. They don't do shit but placate you or like in the store you got associate yelling at another coworker on the phone. Its a shot show and it's not totally t-mobile fault but it is. And it's also Samsung fault too. They made a battery that has created over 2 million people that have lost their shit on people just doing their job or in some cases they (employees) ain't doing nothing to help. Rant over.",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.550853253027166,
    "include_for_labeling": "N"
  },
  {
    "id": "d7n1hfo",
    "text_content": "T-Mobile locations are absolute shit. The T-Mobile phone supervisors are the absolute best. If you ever have a huge problem like this speak directly to a supervisor and explain what they're doing wrong. I've had a supervisor give us a $200 credit in the past. You ended up getting free phones somehow because the supervisors are the only ones that get stuff done.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.7150000000000001,
    "include_for_labeling": "N"
  },
  {
    "id": "d7ncypz",
    "text_content": "I decided to phone an exchange in and do the transfer/backup myself. I made sure to ask about how the temporary exchange would work. Waiting on the phone in the mail.\n\nIMHO, it's far easier than dealing with a person trying to do it in store regardless of carrier or store. I did go in store initially but he actually talked me out of exchanging it. Weird.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.5977777777777777,
    "include_for_labeling": "N"
  },
  {
    "id": "d7q6zov",
    "text_content": "I'm sorry that you had this experience with T-Mobile. With rates that cheap, they have to cut corners somewhere, right? It used to be that you'd be stuck with a terrible network with them, now that that's improved I guess it's customer service and lack of uniformity in corporate store policies?",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.6471428571428571,
    "include_for_labeling": "N"
  },
  {
    "id": "5020lc",
    "text_content": "S Note on the Note 7 I just bought the Note 7. Was super excited but now I'm deflated with S Note app not being on here and I'm curious as to why it isn't? It's pretty much the main app I use and now it's not here at all. They have Samsung Notes, which is nothing like S Note. I use it primarily for making and editing pics. I tried to download S Note from the Play store and it says my phone isn't compatible. Pretty annoyed right now :/ Any help or advice would be sweet. Thank you.",
    "type": "post",
    "score": 7,
    "subjectivity": 0.703,
    "include_for_labeling": "N"
  },
  {
    "id": "d70l3az",
    "text_content": "Go to your widgets and add the galaxy essentials widget. By clicking on it from your home screen you should be able to find and download s notes. I have it on my note 7.",
    "type": "comment",
    "score": 6,
    "subjectivity": 0.625,
    "include_for_labeling": "N"
  },
  {
    "id": "d70k4ub",
    "text_content": "Not sure how different it is, since this is my first note, but from what i understand, they consolidated all of the s pen apps into one app, Samsung Notes",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.6074074074074074,
    "include_for_labeling": "N"
  },
  {
    "id": "d71nzqq",
    "text_content": "Not sure if we can post links, but XDA has a download link to the S Note version that still *mostly* works. The Galaxy Apps store version supposedly doesn't have all of the features available, including Action Memo. Not sure how this cluster f*ck was allowed to make it onto the market after the previous Notes (I had 3, 4, 5, now 7). Samsung Notes is awful. They're catching crap on it from hundreds of reviewers on the play store. Their replies are canned, but maybe they'll do the right thing, because nearly $1K for this is NOT.\nhttp://forum.xda-developers.com/note-7/how-to/guide-how-to-action-memo-t3443584",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.5981962481962482,
    "include_for_labeling": "N"
  },
  {
    "id": "d72ghvt",
    "text_content": "I had no idea this existed, huge step up from the default note installed. Thanks for the hidden gem!",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.4777777777777778,
    "include_for_labeling": "N"
  },
  {
    "id": "56yucj",
    "text_content": "Galaxy S7/S7 Edge production up, likely to cover for Note 7 mess",
    "type": "post",
    "score": 9,
    "subjectivity": 0.588,
    "include_for_labeling": "N"
  },
  {
    "id": "d8npsme",
    "text_content": "Why the fuck would I ever buy another Samsung product?",
    "type": "comment",
    "score": -11,
    "subjectivity": 0.6,
    "include_for_labeling": "N"
  },
  {
    "id": "509ry1",
    "text_content": "Galaxy Note 7 review: Samsung nearly achieves smartphone perfection",
    "type": "post",
    "score": 28,
    "subjectivity": 0.4,
    "include_for_labeling": "N"
  },
  {
    "id": "57bc4n",
    "text_content": "Reports claim most Note7 customers are opting for an S7 edge replacement.",
    "type": "post",
    "score": 72,
    "subjectivity": 0.5,
    "include_for_labeling": "N"
  },
  {
    "id": "d8qjnax",
    "text_content": "I work retail and I notice most people exchanging for the edge 7",
    "type": "comment",
    "score": 14,
    "subjectivity": 0.5,
    "include_for_labeling": "N"
  },
  {
    "id": "d8r0kds",
    "text_content": "I am one of the people who changed to the S7 Edge. I am not happy about it. The phone is fine but I changed from the iPhone to the Note 7 for the S Pen. There are alot of similarities but a few things that are different as well. Guess that is to be expected.\nI am waiting for the new Samsung flagship phone with a S Pen, to rise from the ashes and they should call it \"Phoenix\". Yes pun intended.",
    "type": "comment",
    "score": 8,
    "subjectivity": 0.5090909090909091,
    "include_for_labeling": "N"
  },
  {
    "id": "d8qi4gk",
    "text_content": "Whats bull is that I had a fully PAID OFF S7 Edge that I traded in to get this Note 7... Now I have to go back to a S7 Edge that I have to pay monthly payments on....  Total crap.",
    "type": "comment",
    "score": 26,
    "subjectivity": 0.5166666666666667,
    "include_for_labeling": "N"
  },
  {
    "id": "d8qkj76",
    "text_content": "I'm just holding out on my Note3.\n\nSince there's no promotion going right now on the S7E I think I'm waiting for the S8... only 3-4 months.",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.7678571428571428,
    "include_for_labeling": "N"
  },
  {
    "id": "d8qmobd",
    "text_content": "I never got the 7, would have been nice to at least touch the phone of the gods.",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.7,
    "include_for_labeling": "N"
  },
  {
    "id": "d8rc6qm",
    "text_content": "Honestly I ordered the Pixel XL and got it for $420 with the upgrade discount.   I am torn.  I don't know if I should just get the Galaxy S7 Edge.  I have the 256 Samsung SD Card.\n\nPixel Xl one of the biggest pulls for me is the unlimited storage.  That is a killer sell.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.9,
    "include_for_labeling": "N"
  },
  {
    "id": "d8rd29v",
    "text_content": "After my second note 7 I decided to switch to the 7 edge and if I'm being honest I actually wish I got the edge to begin with. It's a work of art and the perfect size and while I miss the s pen I find the edge so much more comfortable to hold and use. I may switch to a pixel xl if they end up coming to AT&T but we shall see. ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.5499999999999999,
    "include_for_labeling": "N"
  },
  {
    "id": "56mnhb",
    "text_content": "[Hot Topic] Samsung Note7 alternatives? Here are the alternatives (in alphabetical order) I can think of that haven't as much friction as the Note 7:\n\n* [Apple iPhone 7 Plus](http://www.apple.com/ca/shop/buy-iphone/iphone-7)\n* [Asus Zenfone 3 Deluxe](https://www.asus.com/Phone/ZenFone-3-Deluxe-ZS570KL/)\n* [Google Pixel XL](https://store.google.com/config/pixel_phone)\n* [HTC 10](http://www.htc.com/us/smartphones/htc-10/)\n* [LG V20](http://www.lg.com/us/mobile-phones/v20)\n* [Motorola Moto Z](http://www.motorola.ca/products/moto-z)\n* [OnePlus 3](https://oneplus.net/ca_en/3)\n* [Samsung Galaxy S7 Edge](http://www.samsung.com/ca/consumer/mobile-devices/smartphones/galaxy-s/galaxy-s7/)\n* [Xiaomi Mi 5s Plus](http://www.mi.com/mi5splus/)\n* [Sony Xperia C4](http://www.sonymobile.com/global-en/products/phones/xperia-c4/specifications/) or [Sony Xperia XZ](http://www.sonymobile.com/us/products/phones/xperia-xz)\n* [ZTE Axon 7](http://www.ztedevices.ca/axon-cat/axon7.html)\n\nI know all the companies have their own issues, but which one would you go with? If I'm missing any, let me know!",
    "type": "post",
    "score": 26,
    "subjectivity": 0.525,
    "include_for_labeling": "N"
  },
  {
    "id": "d8klb76",
    "text_content": "I'd go with the Pixel XL or V20 if a second recall is happening.\n\nBut none of these phones top the Note7.\n\nWaterproof,\nSplit screen multitasking,\nVR,\nExpandable storage,\nIris scanner ( secure folder with duplicate apps),\nDual ambient light sensor,\nUSB C\n\nAnd of course the s pen",
    "type": "comment",
    "score": 21,
    "subjectivity": 0.45,
    "include_for_labeling": "N"
  },
  {
    "id": "d8ktp03",
    "text_content": "Just switched to android in April so I am not going to iPhone. \n\nBest option for me is LG V20. I didn't care for the s7e edges plus I want something different. ",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.44999999999999996,
    "include_for_labeling": "N"
  },
  {
    "id": "d8kxftk",
    "text_content": "I returned my Note 7 today. I hated to see it go, but I went back to the S7 Edge (the phone I came from). Honestly, I think the Edge has the superior battery life, however. And USB audio seems to work better through it.",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.6,
    "include_for_labeling": "N"
  },
  {
    "id": "d8kzu3m",
    "text_content": "Ya this screws me over completely. I was really looking forward to the Note 7. My iPhone 6plus is having an issue where the screen will randomly go unresponsive and I can only fix it by locking/unlocking the screen. I'll call Apple tomorrow and hopefully I can get it fixed. That way it'll last till Samsung gets their shit together for the Note 7. \n\nNo other phone has the features the Note 7 has. The S pen and secure folder are what I'm mostly looking at",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.46416666666666667,
    "include_for_labeling": "Y" 
  },
  {
    "id": "5jd0fx",
    "text_content": "Cancelled Samsung Galaxy Note7 still has more users than LG V20, HTC Bolt and OnePlus 3T.",
    "type": "post",
    "score": 95,
    "subjectivity": 0.5,
    "include_for_labeling": "Y"
  },
  {
    "id": "dbf8k1o",
    "text_content": "Honestly it was the best phone I ever used. I was a little pissed about the poor scratch resistance of the screen, difficulty finding a good screen protector, and the overall price-tag. However, from the day I powered it on I could tell Samsung really invested in the UI/UX of the touchwiz menus, and overall ease of use of the device. Really great looking phone too, since then I've gone to a Nexus 6P 128GB model, since there's no MicroSD option. I still have the free 256GB MicroSD Samsung sent me for buying the N7, no idea what I'll do with it since I don't have a device that supports it. ",
    "type": "comment",
    "score": 28,
    "subjectivity": 0.465,
    "include_for_labeling": "N"
  },
  {
    "id": "dbfyq3r",
    "text_content": "I traded my Note 7 in for an S7 Edge.  I really hope Samsung provides a good deal on the Note 8 to those of us who were affected by this fiasco.  While I do like the S7, it's a definite downgrade, and that really tweaks my tech-junkie OCD.  I will want to get rid of my current phone as soon as possible in favor of the next Note.",
    "type": "comment",
    "score": 9,
    "subjectivity": 0.41428571428571426,
    "include_for_labeling": "Y"
  },
  {
    "id": "dbg7ajx",
    "text_content": "I am really excited for the Note 8. ",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.75,
    "include_for_labeling": "N"
  },
  {
    "id": "dbgcdgl",
    "text_content": "From reading the independent report of why its battery/design failed. I am glad I didn't hang on to it for safety reasons. But I miss that phone  so much.\n\n",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.40625,
    "include_for_labeling": "Y"
  },
  {
    "id": "dbftpbx",
    "text_content": "Maybe the phone's unique exploding feature (or S Explode) was just something that some users had been crying out for.",
    "type": "comment",
    "score": -4,
    "subjectivity": 0.8,
    "include_for_labeling": "Y"
  },
  {
    "id": "dbfd9yo",
    "text_content": "Im on it right now! #BombsAway",
    "type": "comment",
    "score": -9,
    "subjectivity": 0.5357142857142857,
    "include_for_labeling": "Y"
  },
  {
    "id": "571kfh",
    "text_content": "[Discussion] Note7: for the love of gawd, Samsung don't throw the baby out with the bathwater. The Note platform is an absolute productivity monster. I held on to my Note 2 (which I am back on now, I cannot believe it!) for 4 years because it has helped me do so much. The Note7 was an incredible piece of tech, but the spontaneous combustions wasn't so hot.^ha ^ha ^ha.\n\nPlease, please, please keep making stylus phones. Just make them explode less -- or not at all.",
    "type": "post",
    "score": 11,
    "subjectivity": 0.51, 
    "include_for_labeling": "Y"
  },
  {
    "id": "d8olpan",
    "text_content": "The only smart phones I've owned have been iPhones. I researched the hell out of the S7 Edge and thought about switching. Then I saw the Note7. It looked amazing!  I have one payment left on my iPhone 6, and I was gonna pick up a Note in November. I really wanted to try the stylus. I'm pretty pissed that I won't get the chance. \n\nHow long will it be before we know if they are gonna develop a Note8?  I don't mind waiting if I know that it's coming. ",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.5918367346938777,
    "include_for_labeling": "N"
  },
  {
    "id": "d8orxe5",
    "text_content": "I've been a Samsung user since the Note 3. I moved to that device from an iPhone 4S, and I *adored* it. When I found out the Note 5 wasn't coming to the UK, I got the S6 - again, loved the device, but I missed the screen size and expandable storage. I was so looking forward to getting a Note 7 in April once my current contract is up - now I have no idea what to do. First world problems, I know, but I was so set on the Note before all this... halp!",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.5111111111111112,
    "include_for_labeling": "N"
  },
  {
    "id": "55a3ix",
    "text_content": "Just got my new Note7 I've just got my new Note7. Spen feels better it's more solid and my device is overheating. 🙁\n\nCZ",
    "type": "post",
    "score": 3,
    "subjectivity": 0.402,
    "include_for_labeling": "N"
  },
  {
    "id": "d89y934",
    "text_content": "Damn :(...i want to pick a note 7 up today, but I'm reaaaallly unsure. ",
    "type": "comment",
    "score": 1,
    "subjectivity": 1.0,
    "include_for_labeling": "N"
  },
  {
    "id": "d88u3o2",
    "text_content": "Yep known issue. As much as i love samsung they really dropped the ball on this one",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.4,
    "include_for_labeling": "N"
  },
  {
    "id": "4xt995",
    "text_content": "So excited about the new Note7 in here..",
    "type": "post",
    "score": 27,
    "subjectivity": 0.602,
    "include_for_labeling": "N"
  },
  {
    "id": "d6ir7r3",
    "text_content": "[49.999 Leu = 12.54 USD](https://www.google.com/webhp?sourceid=chrome-instant&ion=1&espv=2&ie=UTF-8#safe=active&q=49.999+lei+to+usd)\n\nOrder these in bulk and profit. I'd give you 79.76 Leu plus shipping without questioning. Unless it's fake. Is it fake?",
    "type": "comment",
    "score": 4,
    "subjectivity": 1.0,
    "include_for_labeling": "N"
  },
  {
    "id": "4ys56v",
    "text_content": "Good tempered glass for Note7? Looking for any glass that covers a majority of the screen, doesn't have to cover the edges as long as it doesn't fall off, had one of those on a s6 edge and didn't stick at all",
    "type": "post",
    "score": 1,
    "subjectivity": 0.5,
    "include_for_labeling": "N"
  },
  {
    "id": "d6q27db",
    "text_content": "From what I understand none are really good. They don't stack very well and the edges peel due to the shape of the phone. The phone is pretty ok with the GG5 screen it has. Have already dropped mine a few times. What does work is one of those screen protectors that gooey wet type. Cause the screen does scratch easy.",
    "type": "comment",
    "score": 6,
    "subjectivity": 0.5135416666666667,
    "include_for_labeling": "N"
  },
  {
    "id": "d6q7rmk",
    "text_content": "Gonna be hard pressed to find a good one. There's still not a good one for the S7E",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.5805555555555556,
    "include_for_labeling": "N"
  },
  {
    "id": "4y7wb9",
    "text_content": "Question about Note7 Pre-order deals Anyone know how long these Samsung phone deals usually last? Like the preorder and get a free Gear Fit2 watch or free MicroSD deals going on now. Or do new deals usually pop up? Are they usually better/worse than the preorder deals?\n\nReason I'm asking is because I'm very interested in switching from my 6Plus to the Note7 but I'd like to see what Apple shows off next month first. The current preorder deals are really good though.\n\nAlso, the last time I had an Android phone was 2013 (the original HTC One). Have they gotten \"smoother\" to use since? With the HTC One, the whole Android OS felt a bit laggy at times and not really as intuitive as an iPhone. Are Samsung phones different? This is the first time I've really considered switching from an iPhone (the HTC One I was sort of forced into and only had it for a few months) and I just wanna make sure I'm well researchedd before taking the dive. Thanks!",
    "type": "post",
    "score": 3,
    "subjectivity": 0.414,
    "include_for_labeling": "N"
  },
  {
    "id": "55gl9a",
    "text_content": "[HELP] Ordered my Note7 on Aug 3, still have phone in a box waiting on Samsung to issue me return...anything? I ordered my phone directly from Samsung.com, assuming that I would receive the device sooner that way, and avoiding signing a contract. Took almost a month, and I received my device the same day they issued their recall.\n\nSince that point, I have called them a dozen or so times, attempted to do live chat, and attempted email. On the phone, I get transferred at least once, but as many as 5 times, before either being told that I will be contacted at a later date, or there is nothing they can do until the new information comes out (always 'tomorrow'), or I get hung up on.\n\nLive chat defaults to 'We are technical support only' after 20 minutes of typing back and forth.\n\nEmail has yet to return any response.\n\nI HAVE received default emails, ie notifications and, most recently, a form to fill out for my a) return and refund; b) return and replace with S device; c) return and replace with a new Note7. The order number in this email was different from the order number on both my shipping label as well as online in my Samsung account. Using the correct order number (the one they provided didn't work), I opted for 'c', was taken to a landing page explaining that I would be receiving my return packaging and information on my replacement within 2-3 days, and received another email with a confirmation number.  This took place on September 22.\n\nSince then, I have called in several times after waiting 5 days, only to begin repeating the process or being hung up on, transferred, or being told that my concerns are important and they will make a note for me (without gathering any information or looking my account up). My online account shows no new orders, or any information about the replacement.\n\nI'm hoping someone here can give me some guidance or phone numbers or anything. After spending nearly $1000 on this phone, it's aggravating to look at it still packaged in it's box.",
    "type": "post",
    "score": 4,
    "subjectivity": 0.432,
    "include_for_labeling": "N"
  },
  {
    "id": "d8ahtfg",
    "text_content": "I got a box Friday in the mail that was to ship it back. It was a pretty intense box meant for the battery issues. Also ordered from Samsung.com\n\n[Same as the one in this post.](https://www.reddit.com/r/GalaxyNote7/comments/558jka/just_received_fire_resistant_shipping_box_from/)",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.53125,
    "include_for_labeling": "Y"
  },
  {
    "id": "4yejlb",
    "text_content": "Note7 and Gear VR...must buy new version? Can we use the first generation Gear VR with an adapter with the Note7, or do we have to buy their new version? Was really surprised that the new Gear VR wasn't one of the promo options...",
    "type": "post",
    "score": 2,
    "subjectivity": 0.519,
    "include_for_labeling": "N"
  },
  {
    "id": "d6n7029",
    "text_content": "Couldn't find a source, but according to what I've heard you will need the new version. The adapter will not fit. ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.42727272727272725,
    "include_for_labeling": "N"
  },
  {
    "id": "d6n7vlg",
    "text_content": "Uncle works for Carphone warehouse. I've tested, you'll need the new one.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.45454545454545453,
    "include_for_labeling": "N"
  },
  {
    "id": "d6nuyp0",
    "text_content": "You definitely need to buy the new version. It's definitely lighter and more comfortable. \n\nHowever, I'm going to keep my Note 5 to use solely for vr. It doesn't make sense to get $200 for my phone only to use half that to buy a new vr. ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.546969696969697,
    "include_for_labeling": "N"
  },
  {
    "id": "50uciy",
    "text_content": "PSA: Recall Process for USCellular Note7 I just got off the phone with US Cellular regarding their handling of the recall for the Note7.  Below is what they said they are doing:    \n \n* Customers with a Note7 is to bring the phone in to a USCC Authorized store for a full refund on all deposits and, if financed, all payments made towards the phone.    \n* USCC is also allowing customers to choose a replacement phone of ANY value (in their stock of course) at no charge.        \n* If you financed your phone, you will have to obviously make the monthly payment on the new phone but they are not charging the activation fee.    \n* Finally, if any accessories were purchased at a USCC store, they are also issuing refunds on those items as well.    \n\nAt the time of speaking with the rep, there is no mention from Samsung as to how they will handle replacing the phone or if a new Note7 will be issued.  As far as we know from the interviews with Samsung reps right now, they will not be announcing this info until next week.  Hope this helps you guys and gals.",
    "type": "post",
    "score": 2,
    "subjectivity": 0.562,
    "include_for_labeling": "N"
  },
  {
    "id": "4zurzq",
    "text_content": "Beyond the Specs: In the End, the Note7 is a Remarkable Phone for Life",
    "type": "post",
    "score": 19,
    "subjectivity": 0.75,
    "include_for_labeling": "N"
  },
  {
    "id": "4zw2i5",
    "text_content": "Using OK Google bypasses lock screen on new Note7 Any ideas how that's possible?",
    "type": "post",
    "score": 2,
    "subjectivity": 0.652,
    "include_for_labeling": "N"
  },
  {
    "id": "d6z6pia",
    "text_content": "It sounds like your \"Trusted Voice\" setting is enabled (under the Settings in the Google/Google Now app). This will bypass the lock screen if the voice command matches the recorded tone.\n\nThis could pose a problem if someone sounds like you. I think one of my coworkers was able to activate my Google Now by saying \"OK Google\".",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.5625,
    "include_for_labeling": "N"
  },
  {
    "id": "4yjnzt",
    "text_content": "[Discussion] Note7 dual Sim card question: Can I use this phone as my work and personal phone? So I currently have a crappy HTC I use as a personal phone and work is having me get a phone. (Sprint)  \n\nMy note 7 is on the way with the new work number but it'll be a phone I own. Naturally I want to use this phone for a lot of personal reasons, as well as work stuff. \n\nGoing into this I was going to have both phones on me, with work calls going to the HTC, (so I can have the ability to shut it off when I'm off work)  and all work emails, reports and personal stuff on the Note 7.\n\nThen I noticed the Note supports two Sim cards. Coulf I just run both cards in the Note 7 and take calls to both numbers on one phone? Anyone do something like this before? What did it look like?\n\nThanks in advance!",
    "type": "post",
    "score": 2,
    "subjectivity": 0.406,
    "include_for_labeling": "N"
  },
  {
    "id": "574ooo",
    "text_content": "Note 7 users I'm sure like everyone else, you love the Note 7. What phone are you getting to replace it and why? I've been looking around for the past 2 days and don't really like anything else on the market or even the v20 for not being waterproof and no SD card. I'm even considering iPhone 7 plus now. This whole changing out phones has been a giant waste of my time, spent 9 hours over the course of 2 days at AT&T store for Chaning out devices TWICE already. So frustrated",
    "type": "post",
    "score": 3,
    "subjectivity": 0.404,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8pmjse",
    "text_content": "The note7 was the best phone I've ever used but this whole recall fiasco has left a bitter taste in my mouth for Samsung.  I ordered an iphone7 plus as a replacement but I'll have to wait 2 or more weeks for it to arrive.  I just came back from a T-Mobile store and was able to get a Samsung on5 as a loaner, with a $50 deposit.  \n\nI used the s7 edge as a loaner for the first recall and hated how the keyboard wrapped around the edge.   It's gonna be weird switching to iOS but other Android devices available under my carrier seemed like much more of a downgrade than the iphone7.  The only silver lining is that I'll be receiving a $25 credit to my next 2 bills for returning my note7 today.  I hope you find something suitable to your needs, I feel your pain :(",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.49313725490196075,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8pdqu2",
    "text_content": "I went with the s7 edge because I have the gear fit 2 and vr coming from the promos and I didn't want to go with another device and not get to use them. ",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.4,
    "include_for_labeling": "N"
  },
  {
    "id": "d8owm32",
    "text_content": "I wish I could help, but I'm God damned frustrated myself.  I absolutely love the Note 7.  I'm seriously considering keeping it and rolling the dice, though I'm quite sure the mandatory insurance will refuse to cover it. \n\n\nEffing hell, it's like finding the perfect partner then finding out they've got AIDS.  I'm so sick of looking and so happy, I'm willing to risk dying. \n\n\nEdit:  to *actually* answer your question, I'm thinking the Google Pixel XL maybe.  Still uses Android (and a clearer version), and has the same size screen and C-usb.  Only downside is no S-pen and no water resistant. ",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.657308201058201,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8p1gok",
    "text_content": "I swapped for the S7 Edge. Not my favorite, but it's pretty well similar specs to the N7 (aside from being a bit smaller).  I wanted to stick with Samsung simply because I got the Gear VR. \n\nIt takes some getting used to, but the S7E isn't a bad phone.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.653968253968254,
    "include_for_labeling": "N"
  },
  {
    "id": "d8p6dn3",
    "text_content": "Nothing on the market is really catching my eye so I'm going with the iPhone 7 plus. I just wish it wasnt back ordered until December on verizon. ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.45,
    "include_for_labeling": "N"
  },
  {
    "id": "d8qq1ls",
    "text_content": "If it weren't for the fact that my carrier doesn't carry the black S7 Edge, I probably would have gone back to that, I've had a silver one before.  So I got a black S7 instead.  I have too much invested in other Samsung products to go anywhere else and be happy....",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.4069444444444444,
    "include_for_labeling": ""
  },
  {
    "id": "56suff",
    "text_content": "Samsung halts Note 7 production after new fire scare: source",
    "type": "post",
    "score": 17,
    "subjectivity": 0.455,
    "include_for_labeling": "N"
  },
  {
    "id": "54p6qr",
    "text_content": "[Other] I want my potentially explosive Note 7 back Hey all, basically a short vent here.\n\nI got my replacement device on Friday and honestly have had nothing but issues with the thing. It's incredibly slow, gets easily bogged down by tasks my Note 5 and previous Note 7 handled with ease, games actually stutter (these same games worked flawlessly on my Note 5), both the iris and fingerprint scanners are somehow slower, the battery life isn't as good as my old Note 7, my apps in the secure folder no longer work (but they do outside of it) and the thing gets HOT. I mean, very hot! My original Note 7 was always cool to the touch and I was never worried about it over heating but with this one I'm actually scared it will blow up. \n\nI'm incredibly disappointed by this replacement device and wish I had just kept my old one. Restoring the device hasn't helped me and I'm not really sure what else I could do. I work for a phone dealer and the thought of sending it to Samsung has crossed my mind but I don't know if it's really a problem that they could fix.\n\nHas anybody else experienced issues with their replacement devices or did I just get a lemon?",
    "type": "post",
    "score": 10,
    "subjectivity": 0.488,
    "include_for_labeling": "Y"
  },
  {
    "id": "d83sxgl",
    "text_content": "Anecdotal and on mobile so I can't easily gather links, but there have already been a few threads/posts of people suggesting their replacement units aren't as \"nice\" as their originals.",
    "type": "comment",
    "score": 4,
    "subjectivity": 0.6444444444444445,
    "include_for_labeling": "N"
  },
  {
    "id": "d83uxiz",
    "text_content": "Well this sucks to hear. I want to pick up a note 7 so badly...😭 \n\nI'd get an S7 instead but I want the S pen! My iphone is so outdated and behind, but all the bad juju around the notes is a red flag for me. :(",
    "type": "comment",
    "score": 4,
    "subjectivity": 0.5499999999999999,
    "include_for_labeling": "Y"
  },
  {
    "id": "d83ztej",
    "text_content": "My new Note 7 has been a disaster.  My old Note 7 was awesome.  Always cold to the touch.  Only got a little warm during charging.  Always fast.  Now it overheats constantly.  And the screen is simply not as good as my old one.  \n\nMore importantly, getting ready to take my phone into T-Mobile as I'm having a persistent \"ghost touch\" issue in the top right of the screen.  I have to use the phone in the reduced size mode to simply use it.  Otherwise a million pages open up making it impossible to use.",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.5989861016176806,
    "include_for_labeling": "Y"
  },
  {
    "id": "d843ft0",
    "text_content": "Check your battery usage. See what is using the most. I had a problem with my potentially explodey note 7 that sounds identical. In my battery usage 'media player' or something like that was using most of my battery.\n\nNarrowed it down to a file that had come across from my old phone incorrectly that couldn't be opened or read. Deleted the file. Like clock work after that. Shame I'm typing this from my note 4 cos I'm still waiting for my new note 7!!!",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.4905723905723906,
    "include_for_labeling": "N"
  },
  {
    "id": "d84bjqh",
    "text_content": "Definitely check your battery usage. \n\nSomething similar happened with my S6 and it was really slow, would get (and stay) really hot for long periods of time, and its battery would be dead after 4 hours with minimal use. \n\nI think it was an app called Ibotta or something but it was using something like 60% of the battery. After looking at what the ap did, I think that it was constantly pinging my location and finding local sales in the background.\n\nI deleted it and the problem was fixed. No more lag while watching youtube, no more lag scrolling through reddit, no more super hot phone while it sat there on my desk unused.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.47333333333333344,
    "include_for_labeling": "Y"
  },
  {
    "id": "d84clj7",
    "text_content": "Hold up. So is the new note 7 a POS? because i am about 10 minutes away from ordering one and if the replacements are shit im not going to",
    "type": "comment",
    "score": 0,
    "subjectivity": 0.6272727272727273,
    "include_for_labeling": "N"
  },
  {
    "id": "53pacg",
    "text_content": "My Note 7 Replacement Experience (Canada) UPDATE 21/09/2016:\n\nSpent another hour on the phone with Samsung, got transferred three times. Again, they said that they will escalate this problem to their manager. \n\n\n\nHello everyone,\n\nI would like to share my experience with getting a replacement Note 7 unit.\n\nI pre-ordered my Note 7 with Bell Canada and got the phone around September 1st. After receiving the notice for the recall, I submitted the replacement form on September 7th.\n\nThe replacement website stated that I \"will be contacted by a Samsung representative within 48 hours.\" I heard nothing from them. I also didn't get any email confirmation after I submitted the replacement form.\n\nI also contacted Samsung about the screen protectors and DBrand skins that I had already applied on the current phone(probably about $40CDN total) and asked for some kind of compensation for the amount I spent. After bouncing me around different departments, I ended up at Complaints (I am not sure why) and all I got was a monotonic \"I understand your concern, but Samsung is not going to pay for your accessories.\"\n\nFast forward a few days later, I suddenly received an email from FedEx telling me that I have a package coming, from sender \"STERICYCLE RMS/CANADA\". I have no idea what this company is until I googled online and some users pointed out that it is the Note 7 replacement unit. Again, I was told that they will contact me to confirm the color of the phone and the address.\n\nHowever, the delivery address is the one that I used to register with my phone carrier. It hasn't been updated for years. This address is certainly not the one I registered the replacement form with. I have no clue how they got this information.\n\nSince Friday, which is the day I received the FedEx notice, I have been contacting Samsung and FedEx trying change the delivery address. With FedEx, they told me that the value on the package is too high for the receiver to change the address.\n\nAt Samsung, no one knows how to change the address and no one seemed willing to help out either. The department that handles the Note 7 Replacement says that they only help people with replacement registration and not responsible for anything afterwards. The main customer service line refers me back to the Replacement number.\n\nI have probably wasted 10+ hrs on the phone with them. It was not just the fact that they had no clue what was going on; Samsung customer service's tone and attitude pretty much gave me cancer.\n\nRight now the package is \"Out for Delivery\" at a city no where near where I live and I have no idea what to do.\n\nI am so disappointment with Samsung as a company and how they handle problems like this. It really shows how bad the internal communication is.\n\nI am going to try to get a refund for the Note 7 and change it to either an iPhone or wait until the new Nexus(or Pixel) phones come out. I am done with Samsung for the time being.\n\nThanks for reading, and I hope the rest of you guys receive your Note 7 replacement without too much trouble. And have a good day! :)",
    "type": "post",
    "score": 13,
    "subjectivity": 0.456,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7v4i78",
    "text_content": "I feel your pain.  I filled out that form over two weeks ago and haven't heard anything.  No calls,  no emails,  nothing.  At this point,  much like yourself,  I might just exchange it for the new Google phone. ",
    "type": "comment",
    "score": 5,
    "subjectivity": 0.5181818181818182,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7vec7e",
    "text_content": "I filled out the form a couple weeks ago. Got a shipping notification Friday. New Note Monday afternoon. Dunno when or where I'm gonna take the old one.",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.5181818181818182,
    "include_for_labeling": "N"
  },
  {
    "id": "d7vr3el",
    "text_content": "The company handling logistics / replacement has a separate toll free support line, did you try calling that?",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.8,
    "include_for_labeling": "N"
  },
  {
    "id": "d7vxph6",
    "text_content": "Filled one out the day bell sent me that annoying text. \n\nI accidently chose to have it delivered to a retailer... I haven't heard shit since and bell keeps telling me Samsung will send it to me. I guess I'll just keep using my bomb phone. ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.8666666666666667,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7vyc2k",
    "text_content": "For your next device i'll recommend you any of CAT's phones. \nS60 is a great device, and even S50 is a decent one.\nBiggest difference between Samsung and CAT is how greedy and nuts samsung is.\nMy boss have broken front glass of his S50 phone , it was his fault.  I've ordered a service and a courier collected the broken phone from me, delivered it to the service and brought it back to me in less than a full week.\nSamsung on the other hand is keeping my new device (note 7 ) for over a week now ('ive send it to them on 12th of sept.) and i don't have my new device i've paid for. \nCAT did repair the S50 for free (delivery incuded) even though it was a user fault that the front glass has shattered. \nSamsung is a bad company, i don't recommend anyone any contacts with samsungs employes or buying any samsung products.\nNow only thing i'll think of buying from samsung is going to be a fast ssd's if there is going to be no real competition in this market from other brands. \nSamsung phones are only for sadomasochists, and only for the hardcore ones. \n\nOh, and replacement process was supposed to start from 19th of september in Poland, but it's 21th of september and nobody has seen anything about the new devices.\nLazy samsung's bastards.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.5387445887445887,
    "include_for_labeling": "N"
  },
  {
    "id": "53ic1k",
    "text_content": "Note 7: Samsung can no longer take returns (If ordered through Samsung.com) (I ordered my Note 7 Directly from Samsung.com)\n\nI was on vacation when the whole recall thing started. I finally got home and found out FedEx, UPS, USPS are no longer taking the Note 7 back to Samsung because of the possibility of them exploding (As of 9/16/16). I called Samsung's eCommerce dept and they gave me a new number to call. I called them and they told me to stop using the device and sit on my hands until they figure something out. WTF samsung. Anyone else having issues exchanging their notes through Samsung? (Not talking the people who got their Notes from brick-n-morter stores.)\n\nEDIT from 10/1/16: Still waiting for Samsung to figure out what the hell to do.  I not decided to just return it, tired of this shit customer service.",
    "type": "post",
    "score": 24,
    "subjectivity": 0.594,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7td75z",
    "text_content": "Because of the recall the FTC blocks shipping companies from taking these devices.  Same as going on an airplane, the airlines are gonna ask you if it's a recalled phone and if so you can't fly with it.  \n\nRight now from what I've heard they're discussing whether they're gonna have to send out a kit for battery removal or if they're just gonna tell you to toss it.",
    "type": "comment",
    "score": 12,
    "subjectivity": 0.5202380952380952,
    "include_for_labeling": "N"
  },
  {
    "id": "d7vblas",
    "text_content": "OP I sell stuff for a living. I am telling you right now you need to call them and not get off of the line until you have a solution or a refund. If they refuse, kindly tell them you will be doing a chargeback to your account and that they may pick up the device at X address. Fuck that.",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.6785714285714285,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7tt7fo",
    "text_content": "As I have posted else-ware, I currently have my original Note 7 and replacement Note 7 in hand from Samsung directly.",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.5166666666666666,
    "include_for_labeling": "N"
  },
  {
    "id": "d7tm5t3",
    "text_content": "My understanding is that your carrier will exchange your phone, if you can't bring it to the original place of purchase. ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.75,
    "include_for_labeling": "N"
  },
  {
    "id": "d7uljbu",
    "text_content": "I've spent 9 hours on the phone with Samsung over the past 2 weeks...each time I call, I'm transferred to about 8-9 people, who say they need to transfer me to the \"right department.\" Then when I get the final person, they say, \"Unfortunately we can't help you with returns.\" \n\nThe best was yesterday, when after my eleventh transfer the woman on the line said, \"Unfortuantely we do not handle any kind of returns from Samsung.com.\" I said, \"Well, this is the official exchange line. If you don't do it, WHO DOES?\" \"Um...uh...I'm sorry I just don't know the answer to that question.\" I stayed on the phone with her for 30 minutes, and she just didn't know who could help.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.6357142857142857,
    "include_for_labeling": "N"
  },
  {
    "id": "d7teq5q",
    "text_content": "Da FUK!!!!!!!!!!!!\n\nthis is a total nightmare",
    "type": "comment",
    "score": 0,
    "subjectivity": 0.75,
    "include_for_labeling": "Y"
  },
  {
    "id": "50wf7x",
    "text_content": "For anyone who bought a Note 7 from non-retailers. We're pretty much stuck with a ticking time bomb :( and 800 bucks down. \n\nhttp://imgur.com/a/UEhNW",
    "type": "post",
    "score": 4,
    "subjectivity": 0.622,
    "include_for_labeling": "Y"
  },
  {
    "id": "d77mbb9",
    "text_content": "I'm sure this falls under eBay Buyer Protection.  Full refund",
    "type": "comment",
    "score": 5,
    "subjectivity": 0.7194444444444444,
    "include_for_labeling": "N"
  },
  {
    "id": "d77i86e",
    "text_content": "The Note7 battery issue is only affected for a small percentage of the phones that Samsung shipped. They simply don't wanna take the risk. ",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.5857142857142857,
    "include_for_labeling": "N"
  },
  {
    "id": "56vmk9",
    "text_content": "Samsung officially recalls ALL Note 7 phones, including replacements from the original recall.",
    "type": "post",
    "score": 23,
    "subjectivity": 0.75,
    "include_for_labeling": "N"
  },
  {
    "id": "d8n1lxb",
    "text_content": "This fucking sucks. I know I should return my Note 7 but there are not any phones that come close to matching it. Fuck this situation.",
    "type": "comment",
    "score": 21,
    "subjectivity": 0.44999999999999996,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8mums6",
    "text_content": "What a joke, what an absolute joke. What the fuck are they doing?? They already fixed them right?? \n\nThis will destroy the Note series, I have never seen a tech disaster like this before. \n\nHanded in my Note 7 yesterday. Good, fuck it. Not worth the hassle dealing with Samsung again. ",
    "type": "comment",
    "score": 15,
    "subjectivity": 0.44196428571428575,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8n4ua7",
    "text_content": "Just spoke to Carphone Warehouse in the UK and they're still waiting for update from Samsung regarding our options, but said the phone is being discontinued altogether. I.e there won't be any more \"safe\" replacement note 7s. Fuck.",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.5333333333333333,
    "include_for_labeling": "N"
  },
  {
    "id": "d8njat2",
    "text_content": "they still sell it on their official website, weird they are making a recall before selling it??",
    "type": "comment",
    "score": 2,
    "subjectivity": 1.0,
    "include_for_labeling": "N"
  },
  {
    "id": "5hrjxt",
    "text_content": "I know buying and selling is frowned upon, but maybe you guys can help. I want to find a Note 7. New preferred but used is okay. READ! I know, I know, recall, safety hazard, blah blah blah. I want one for collector's value. It will not ever be powered on, it will sit in the box in a hard protective case in a safe for several years until it's extremely collectible and sought after. That said, IF YOU HAVE ONE, I WANT IT. NAME YOUR PRICE! I WILL PAY UP! Any carrier, any storage, and I don't care if it's the original N7 or the replacement S version. \n\nI'd be willing to offer AT LEAST $900-1000 to anyone who has one, and if it's new in box sealed, I'd be willing to start around $1200-1300 or even more. I also have some other rare collectible electronics I could trade you. In contract? I'll buy out your contract for you as well so you don't have to trade it in! Over 93% of these devices have been returned so I NEED ONE ASAP!!! Please help, or even help link me with someone who has one! \n\nIn addition, if you can link me to someone who has a Note 7, AND it results in a completed sale, I am willing to offer $100.00 as a finder's fee!\n\nPlease, I am NOT kidding around here! I am COMPLETELY SERIOUS! I will pay through PayPal, and have it shipped FedEx with full insurance and signature, hell, if you're in the continental USA, I'll fly to you to pick it up and pay in cash!",
    "type": "post", 
    "score": 4,
    "subjectivity": 0.597,
    "include_for_labeling": "Y"
  },
  {
    "id": "db2cp2f",
    "text_content": "You're a moron. Good luck finding someone who will courier it to you",
    "type": "comment",
    "score": 14,
    "subjectivity": 0.8,
    "include_for_labeling": "N"
  },
  {
    "id": "db30ixu",
    "text_content": "Maybe I'm the crazy one here, but is there actually any chance of the N7 being of any value? Ever? I mean your offering 1000 bucks  for a phone that can never be used. Please prove me wrong! I'd love to see the precedent here. ",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.6375,
    "include_for_labeling": "N"
  },
  {
    "id": "db2wz5b",
    "text_content": "Why would it be so sought after? This is just an iterative phone without any real meaning except that it's pretty rare and can potentially blow up.\n",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.8,
    "include_for_labeling": "N"
  },
  {
    "id": "db3cwrt",
    "text_content": "Our product Trainer has already done just this. I have to admit it is a visually pleasing device :)",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.5,
    "include_for_labeling": "N"
  },
  {
    "id": "db3img6",
    "text_content": "Man i live in western ma and would totally hit you up on this. But the drive is over 5 hours D:",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.4166666666666667,
    "include_for_labeling": "N"
  },
  {
    "id": "521mg3",
    "text_content": "Who here is still holding on to their Note 7's despite the recall? What precautions are you taking? As the title says. I for one can't be arsed to swap my Note 7 to something else, only to swap it back to a Note 7 later. It took me forever to transfer and set everything up this time round. Plus, for AT&T at least, it seems they're only giving you the new phone once you send your current one in, which kinda doesn't give me a lot of options for backing up and transferring my data. So I'm waiting for the fixed Note 7s to come out again, before I do my swap.\n\nI for one have disabled fast charge, kept my phone out of the sun/heat, and only either used OEM chargers or Qi wireless charging. Basically, try to keep the amount of juice you're pumping into the battery minimal - enough for a charge, but not so fast it causes overheating. I also theorized that some of the explosions could've been caused partly by third-party USB-C chargers (the cheapo Chinese ones) that aren't certified (look up the Google guy whose Macbook got fried because of a cheap USB-C charger and started certifying them from now on).\n\nFrom my limited understanding of batteries in engineering school and from the reports about hot Note 7s before they explode, I'm also minimizing the amount of heat it generates - every time my phone starts to feel warm, I stop charging and cool it under cold water immediately. I also stopped using it while it's charging.",
    "type": "post",
    "score": 3,
    "subjectivity": 0.518,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7gn7s4",
    "text_content": "Tbh im not sure man. They texted not too long ago saying to turn it off and  exchange. I actually just got an email from samsung right now. Will check soon. But im not sure, i may wait a day maybe or until monday i work tomorrow so no other Cell phone to use. Kind of playing by ear for now. It does get hot charging but i make sure to watch it if i do charge it and never overnight or unattended. So far no concerns but who knows. I really liked my note",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.6933982683982683,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7gtf8h",
    "text_content": "i haven't had issues with mine heating up while charging :/ i really dont know what i should do, 35 out of 2.5 million is a small number to make a decision over",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.5333333333333333,
    "include_for_labeling": "N"
  },
  {
    "id": "d7gz8et",
    "text_content": "I only use wireless charging and put the Qi charger + phone on a fireproof dinner plate during charging.  I only charge it during the daytime when I am able to keep an eye on it and turn off the phone at night before going to bed.  I'm keeping my phone until the new Note 7s come in.",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.7698863636363636,
    "include_for_labeling": "N"
  },
  {
    "id": "d7hfmpm",
    "text_content": "In all fairness, it's something like 35-40ish reports with 2.5 million shipped? Those odds aren't bad, I think I'd have to buy a lotto ticket if mine blew.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.6666666666666666,
    "include_for_labeling": "N"
  },
  {
    "id": "d7i555x",
    "text_content": "At the very least you should turn off fast cable charging. Settings, battery, advanced settings.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.5733333333333334,
    "include_for_labeling": "N"
  },
  {
    "id": "5b9232",
    "text_content": "Getting really frustrated with the Note 7 exchange in Australia. I am seriously getting frustrated with the Note 7 exchange program here.    \n  \nI bought a Note 7 from a store in Singapore, was force to leave it behind and had a family member ship the replacement Note 7 to me. And now the saga really begins.  \n  \nSo the 2nd Note 7 recall begins, I go to a Samsung store in Australia, they tell me I have to go through support.  \nI call support on October 13 and they say 14-21 buisiness days for processing and I get a replacement Edge 7.    \nOK, that's fair organizing this stuff takes time, etc.  \nNow, I get a call on Nov 3rd, \"Oh your processing is complete, now wait up to 21 business days  for us to send a courier to your door, no we aren't going to make sure he calls you to arrange some pickup time, it's down to pure luck if you're around at that time, he might leave you a note if he can't find you. \" Well duh, we haven't coordinated jack! Are they just expecting me to be at my apartment for the entirety of the next 21 days?  \n  \nOh and they'll be sending me the gift voucher by SNAIL MAIL, and they are only posting it after I make the exchange.  \nSo that's another week or so of hoping I don't drop my phone face first, or just wasting that money buying the case out of pocket.  \nOh and they were also apparently out of my first choice of color too, they only told me that in Novemeber.  \n   \nMy only question is: WHY?  \nWhy can't I just go to a service center somewhere, hand in my phone and get the new one. I'd take an Uber to some random warehouse in the outback if it would be faster.  \nWhy can't they just email me the voucher, or hand it with the courier who is apparently authorized to handle a $1000 device.   \n  \nI was still a Samsung fan after the first recall, now this second recall is has killed any brand loyalty to Samsung. If one more thing messes up with this process I'm not even going to consider them for my next phone.  \n\n/Rant over",
    "type": "post",
    "score": 11,
    "subjectivity": 0.41,
    "include_for_labeling": "Y"
  },
  {
    "id": "d9mr4hl",
    "text_content": "Where are you in Australia? You might have better luck getting it sorted visiting the booths they have set up booths in most major airports specifically for people like you who are stuck overseas with a the Note 7. ",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.5,
    "include_for_labeling": "N"
  },
  {
    "id": "d9o2928",
    "text_content": "That's a bit wierd. \n\nA mate of mine who bought it out right went to the Samsung store in Perth and got a refund straight away. \n\nAnother mate went to Telstra and got his contract cancelled with no problem. \n\n\nThe people at the Samsung store you went to might have been lazy. \n\nGoodluck with everything mate. ",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.6452380952380953,
    "include_for_labeling": "N"
  },
  {
    "id": "d9nyfn9",
    "text_content": "In the US at least you can return the note 7 even if it is cracked for a full refund.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.47500000000000003,
    "include_for_labeling": "N"
  },
  {
    "id": "52emjx",
    "text_content": "Is it only the Galaxy Note 7 being recalled, or the Galaxy S7 / Edge? Canada if it matters I tried googling through some results, but everything I find just talks about the Note 7, although I have heard of the S7 and S7 edge exploding as well.\n\nIs there a Recall on the S7?",
    "type": "post",
    "score": 4,
    "subjectivity": 1.0,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7jl0ec",
    "text_content": "Note 7 only and it is due to battery supplier, SDI (Samsung branded) of the 3500Mah batteries.\n\nThe batteries in the GS7 are 3700MAh and are from China 3rd party, not SDI.",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.4583333333333333,
    "include_for_labeling": "N"
  },
  {
    "id": "d7jnbrv",
    "text_content": "The Note is the only one that has been recalled for now, but it's only a matter of time before the exploding Edge is recalled as well:\nhttps://www.classaction.com/news/exploding-galaxy-edge-s7-causes-3rd-degree-burns-man/\nSamsung keeps downplaying the battery issue, but they have a full-blown crisis on their hands...",
    "type": "comment",
    "score": 1,
    "subjectivity": 1.0,
    "include_for_labeling": "Y"
  },
  {
    "id": "5h18ql",
    "text_content": "Samsung hasn't shipped me a Note 7 return box yet. I'm moving to another state in two week and I have no idea what to do I purchased a note 7 directly from Samsung.com.\n\nAfter receiving the device, I moved from the west coast to the east coast. Once I heard the news about the recall, I contacted Samsung and informed them that I have moved and that I'm requesting a refund. The agent assured me that shouldn't be an issue and that I should be receiving a return package within 3 to 5 business days. As far as I know, the package went to my old address.\n\nEver since then, I have been calling Samsung at least twice a week. Every time I call, I get the same answer, we made a mistake, we fixed it and that I should be receiving a return package within 3-5 business days.\n\nI started this process around Oct 11th. It's now Dec 6th. I have called Samsung more than 35 times and I have spent more than 9 hours speaking to various agents and supervisors (have records from Sprint that proves this.)\n\nI'm moving out of the state I'm in now in two weeks. I'm extremely worried that I won't be getting a return package before then. Because I'm not allowed to fly with this phone, I have to leave it behind. It is not fair to lose the money I have spent on this phone because Samsung seems to fail at sending me a package. I'm absolutely desperate.\n\nI have tried reaching out to their their social media team and they referred me back to the phone numbers I have been calling for the last seven weeks. I emailed Samsung ecommerce team and I haven't gotten any responses back. I contacted my carrier (Sprint) and they said they can't do much for me because I bought the phone directly from Samsung.\n\nA typical day for me now: http://imgur.com/WynFXuX",
    "type": "post",
    "score": 2,
    "subjectivity": 0.402,
    "include_for_labeling": "Y"
  },
  {
    "id": "dawo688",
    "text_content": "Contact your credit card company if possible",
    "type": "comment",
    "score": 3,
    "subjectivity": 1.0,
    "include_for_labeling": "N"
  },
  {
    "id": "db0a8vt",
    "text_content": "You're probably not gonna get help fast because of holiday season they're probably just getting bombarded with all holiday stuff.\n\nIf you don't get the return box yet what I would do is use USPS to send the phone to yourself by sending to your new home address.\n\nsure it will cost you some money but you can just use cheapest USPS option. And then I would just wait until Jan 8; which is their official date where they will roll out the software update to disable all NOTE 7s. After that happens I would try contacting them",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.6478114478114477,
    "include_for_labeling": "N"
  },
  {
    "id": "51mixz",
    "text_content": "Note 7 recall question. So as I was working today my phone hit my leg quite hard and of course damage was done. Right under my home button is a tiny tiny spider crack aboiut a 1/4 the size of the button itself. With the recall are they gonna hit me for stuff like that?",
    "type": "post",
    "score": 2,
    "subjectivity": 0.519,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7d62bx",
    "text_content": "Afaik they will replace phones with broken screens.\n\nA full refund might be possible,but cpuld be denied because the phone is not \"as new\" considering the damage.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.4681818181818182,
    "include_for_labeling": "N"
  },
  {
    "id": "d7d2ons",
    "text_content": "Also does anyone know they're going to be doing a full refund? ",
    "type": "comment",
    "score": 0,
    "subjectivity": 0.55,
    "include_for_labeling": "N"
  },
  {
    "id": "523zdp",
    "text_content": "Discussion: How long do you think it will take to the Note 7 hit the market again? Pre-ordered mine and now i'll have to wait longer xD! Really hope it doesn't take long but maybe only in october.",
    "type": "post",
    "score": 6,
    "subjectivity": 0.5,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7h55ow",
    "text_content": "I'm sure they'll be available everywhere by October.",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.6444444444444444,
    "include_for_labeling": "N"
  },
  {
    "id": "d7hal7o",
    "text_content": "Anywhere you can get them cheap atm? ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.7,
    "include_for_labeling": "N"
  },
  {
    "id": "51na1m",
    "text_content": "Anyone been able to exchange a recalled Note 7 for a new Note 7 yet?",
    "type": "post",
    "score": 6,
    "subjectivity": 0.54,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7dcke5",
    "text_content": "Samsung Direct told me end of this week. ",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.4,
    "include_for_labeling": "N"
  },
  {
    "id": "d7d9fkb",
    "text_content": "Tmobile tells me a month at worst, next week at best\n\nI'm OK we got s7s to hold us over",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.45,
    "include_for_labeling": "N"
  },
  {
    "id": "50vfxn",
    "text_content": "Returned Note 7 to T Mobile for recall. I went today to the T-Mobile store to see what was going on. First, T mobile website claims that the Note 7 devices can be turned in for a full refund (or whatever you've paid on lease/jump) In addition, any accessories can be returned.\n\nThe T-Mobile reps were probably the worst, none of them knew anything. I had to explain to them the post on their own website, the TMobo Manager was dumbfounded. All they knew was to stop selling Note 7 devices. So the manager called HQ or whatever is there store's head. They further prompt her to take my device(Note 7) and:\n\nOption 1:\n-Refund any payment made for the phone ($69.99 upfront cost and a monthly charge $40) \n-I brought back the S view case (without packaging and Gear VR) and they provided a full refund to my card. (No, restock fee) \n-Third they drop a Jump! on Demand and let me Jump! to another phone (I took the iPhone 6S for now, maybe wait for the note 7 or iPhone 7 ill see.)\n\nOption 2:\n\n-Keep your Note 7, let them put a note and request on your account that you want a new Note 7 and wait an estimate of two weeks for new stock of Note 7 that are \"fixed\" They told me it will be a brand new box/phone that I will receive.\n\nNote: \nI took option 1, because I didn't want the Gear VR and S View Case so I found the perfect opportunity to get a refund. Also, GO TO YOUR THE T MOBILE YOU BOUGHT YOUR PHONE. I went to a different T mobile store they sent me to my original store. My phone also had hairlines cracks and they still took it. Maybe everyone will have different experiences, but here was mine. Overall, company policy was great no complaints, the T mobile reps sucked.\n\nEdit: Also got to keep my Netflix sub too.",
    "type": "post",
    "score": 2,
    "subjectivity": 0.537,
    "include_for_labeling": "Y"
  },
  {
    "id": "d77vkke",
    "text_content": "T-Mobile's reps do suck! I got 2 defective Note 7s & had a hell of a time with T-Mobile. I posted about it [here](https://www.reddit.com/r/tmobile/comments/50kmx9/2nd_boot_looping_note_7_tmobile_wont_exchange_it/). The stores not being able to help you most of the time drives me crazy!\n\nFrom my understanding, if you got a refund you've been dropped out of the JoD program & won't be able to get back in. ",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.53,
    "include_for_labeling": "Y"
  },
  {
    "id": "58dawf",
    "text_content": "What's the best way to contact Samsung about not being pleased with how they handled the note 7 recall?",
    "type": "post",
    "score": 6,
    "subjectivity": 0.65,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8znb5y",
    "text_content": "They won't give a shit unless you sue them, the $100 credit for exchanging to s7/s7e is a shit deal when they offered $200 discount at launch for Note 7 in Canada",
    "type": "comment",
    "score": 6,
    "subjectivity": 0.8,
    "include_for_labeling": "Y"
  },
  {
    "id": "d8zij12",
    "text_content": "What makes you say they are poorly handling the recall? ",
    "type": "comment",
    "score": 3,
    "subjectivity": 0.6,
    "include_for_labeling": "N"
  },
  {
    "id": "51pecv",
    "text_content": "[Help] Note 7 Recall - Backup using MicroSD Smart Switch? Hey everyone,\n\nSoon I'll be going for the exchange program, and where I'm from we are only offered the option of backing up through Smart Switch via MicroSD card or Smart Switch PC. \n\nI've only used the Smart Switch via USB Cable and everything was exactly the same(home screen, wallpaper & apps etc) when transiting from my old Note Edge to the Note 7.\n\nMy question is, does Smart Switch via MicroSD work the same as via USB? It seems to have backup'ed everything I have selected to my MicroSD card, and just need to insert and restore into the new set, but I have no way to find out if it's the same as Smart Switch via USB. Anyone have experience from doing this and can share some insight? Much appreciated.\n\nEDIT: Does content in the Shared Folder get backed up too?\n\n[Here's the Image](http://imgur.com/a/3JwMq) of the provided How-to in case anyone needs it.",
    "type": "post",
    "score": 12,
    "subjectivity": 0.508,
    "include_for_labeling": "N"
  },
  {
    "id": "d7dtd1s",
    "text_content": "Smart Switch to the SD card works the same way.\n\nAnything that shows up in your phone's file browser (My Files) under the documents, images, audio, and videos categories gets backed up.\n\nIn Smart Switch, you can see which actual files are being backed up by tapping the arrow to the right of \"Documents\" at the content selection page. If you're unsure about a folder, break out the OTG adapter the phone came with and put it on a thumb drive or manually move it to the SD card or a PC separately.\n\nSpeaking of PC, I highly recommend backing up with the PC or Mac version of Smart Switch in addition to the SD card, just in case.\n\nWith a brand new phone and card the external storage backup method should be perfectly fine but I have seen cases where people used that method alone on devices which were already experiencing issues, only to find out later that the new device is unable to restore from that backup.\n\nThat particular problem can be caused by faulty or even malicious apps on the phone corrupting the backup, failing/defective SD cards, or even incomplete/broken OS updates causing other issues interfering with the backup process. It's not super common, but it happens.\n\nBetter safe than sorry, I say. And it never hurts to have a fully offsite backup too.",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.4815893630179345,
    "include_for_labeling": "N"
  },
  {
    "id": "51r7g1",
    "text_content": "I'm guess the promotion still goes on when the note 7 becomes available again?",
    "type": "post",
    "score": 13,
    "subjectivity": 0.4,
    "include_for_labeling": "Y"
  },
  {
    "id": "d7eenhc",
    "text_content": "Ran out of watches. That's to be expected. \n\nSo it's between a microsd card and a gearvr. Better value is probably the micro SD card. \n\nWhen they get enough inventory again and work through the recalled units I'd expect a similar or better promo. \n\nAfter all, they can't afford not to sell units, they're already spending $1B on the recall so they might as well put $10-30M into a post recall discount promo campaign so new customers buy a Note 7 or are interested in an S8. \n\nWithout continued momentum beyond the recall, major market share is in jeopardy. Which is why they spent $1B on the recall immediate. They can't afford not to. ",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.42828282828282827,
    "include_for_labeling": "N"
  },
  {
    "id": "59ppwi",
    "text_content": "Cracked S7 Edge screen, options? So the other day I dropped my S7 Edge and messed the screen up pretty bad. On top of that, the display is now super bright and barely usable. Everything still seems to work otherwise.\n\nI called around the local repair shops/kiosks and everyone says about $400 to repair it. I called Samsung and they said they would do it for $260 but then immediately told me that their repair program is \"temporarily\" suspended due to business conditions (aka Note 7 recall). I was directed to a Best Buy where there's a Samsung rep, was told they could fix it there, but then when I got there the guy told me that he couldn't. Called Samsung again and was told about walk-in service centers in NJ, NYC, and LA, the closest of which is not even an option.\n\nI'm just incredibly frustrated that it seems like my only option is to pay a third party $400 to fix it. I understand it's my fault that I dropped it but I feel like Samsung has completely hung me out to dry. Everyone I talk to is in shock by how much a screen replacement costs for this phone.\n\nDoes anyone have any other suggestions? All I want is to pay for Samsung to fix it so I know it's a quality repair.",
    "type": "post",
    "score": 6,
    "subjectivity": 0.445,
    "include_for_labeling": "N"
  },
  {
    "id": "d9al1re",
    "text_content": "Go to the Samsung care website and pay the insurance.  I had a crack at my S7 Edge, (mine was usable though).  It was $120.  Then after 30 days you can make a claim and has a deductible of $99.  They overnight you a phone and you can send your cracked phone to them. $220 is better than $400.  And it comes directly from Samsung which is good.",
    "type": "comment",
    "score": 9,
    "subjectivity": 0.5,
    "include_for_labeling": "N"
  },
  {
    "id": "d9ai43k",
    "text_content": "I hate to say it, but there's not much you can do. Either pay for the repair or get a new phone",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.5181818181818182,
    "include_for_labeling": "N"
  },
  {
    "id": "d9ax8rc",
    "text_content": "If you have a ticket number or the name of the rep that told you the samsung rep at best buy will fix it PLEASE give that info to your nearest samsung rep. So sick of those call center people ruining customer experience like that when they know its not possible",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.5642857142857143,
    "include_for_labeling": "N"
  },
  {
    "id": "d9azos4",
    "text_content": "Is it expensive because of the curve edge?",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.7,
    "include_for_labeling": "N"
  },
  {
    "id": "5kpx36",
    "text_content": "Holding out hope for S8... So, I work for Samsung... I LOVED the Note7. Everything about it was great... exept for the whole blowing up flaw. Rumors abound say that Samsung will likely stop continuation of the Note line, and that the Galaxy S line will be the flagship going forward. That said, one of the best things I loved about the Note was the bigger screen, and the s-pen. I can live without the pen, but if the actual phone size rumors of 5.5 and smaller are to be believed, I think I will be done with Samsung phones for the forseeable future. I reverted back to my Note3 when they forced the Note7 Recall and it's beginning to show it's age. I'd REALLY like for the 6.2 rumor to be true, but I could live with 5.7, anything less than 5.7 and i'm outtie...",
    "type": "post",
    "score": 9,
    "subjectivity": 0.435,
    "include_for_labeling": "Y"
  },
  {
    "id": "dbq27cn",
    "text_content": "isn't the screen bigger on s8? I don't see why having a bigger phone is better than having a smaller phone with the same screen size 6.2",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.425,
    "include_for_labeling": "N"
  },
  {
    "id": "dbqkz1d",
    "text_content": "I just want the S8 so bad. My S6 battery died to were it wont turn on and I am not about to get the S7 right before the S8 comes out\n",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.6011904761904762,
    "include_for_labeling": "N"
  },
  {
    "id": "58t6hm",
    "text_content": "Help with restoring Samsung backup without Samsung phone. Hi all, due the Note 7 recall I returned my Note 7 and am now using the Pixel (Don't hate >_>). Unfortunately I made the mistake of using Samsung account to backup contacts and texts etc.\n\nDoes anybody know a way of restoring data from a samsung backup with a samsung phone? \n\nThanks.",
    "type": "post",
    "score": 4,
    "subjectivity": 0.619,
    "include_for_labeling": "Y"
  },
  {
    "id": "54ic1q",
    "text_content": "Samsung Wireless Quick Charger Issue I have used this charger with a pre-recall Note 7 and 2 S7E's without any issue.  On my new Note 7 it won't connect on quick charge, it just says Wireless Charging and it's not charging the phone faster than the battery is draining.  Any ideas on how to trouble shoot this?",
    "type": "post",
    "score": 3,
    "subjectivity": 0.414,
    "include_for_labeling": "N"
  },
  {
    "id": "d833ju8",
    "text_content": "By any chance is fast wireless charging disabled?",
    "type": "comment",
    "score": 1,
    "subjectivity": 0.44999999999999996,
    "include_for_labeling": "N"
  },
  {
    "id": "52gnbl",
    "text_content": "Need Verizon replacement advice I read through the Verizon release concerning the Note 7 recall and it seemed vague in not mentioning the exchanged device being a loaner or being able to swap that loaner in for a replacement Note 7 once they were available. All the other carriers specifically mentioned being able to swap again for another Note 7. So, I called Verizon and, after a lengthy conversation in which he claimed he wasn't aware of a Note 7 recall (seriously? How are you not aware? He said the recall was the S7 Edge. I told him to check again, but that is beside the point), he finally found the information and read it to me that I would be able to swap again for a replacement Note 7. \n\nSo, I headed off to my local corporate store. My local store is a regional sales office I believe. This is important to the story. \n\nI was told by a rep there, and again by the store manager, that I could only swap once and whatever device I swapped for was the one I was stuck with. No additional swap for another Note 7. I had 3 choices; keep my existing Note 7 and wait to see if the replacements come in before Sept 30, swap before then and settle on a different device, or activate an old phone on my account and return the Note 7, losing my 2GB bonus data, and then upgrade to a new Note 7 once they become available. I left ticked off. \n\nI called Verizon back, spoke with another person who said the manager is incorrect and confirmed the original information; I can swap now, for a loaner, and get a replacement Note 7 when the come in. \n\nSo what's the true story here? If the store manager is refusing to honor this, I'm not sure what to do. I've want the Note 7. I've spent money on Note 7 accessories (are they refunding those? If so, who? Verizon or Samsung?). \n\nCan someone advise on what they've done?",
    "type": "post",
    "score": 2,
    "subjectivity": 0.475,
    "include_for_labeling": "N"
  },
  {
    "id": "d7k57vd",
    "text_content": "Wow, the Note 7 came with 2G bonus data?  The salesman didn't bother to tell me about that one.    Anyway, no, the phone CSRs at Verizon may be saying there are loaners, but the guy at the store I frequent was pretty vehement that there aren't.",
    "type": "comment",
    "score": 2,
    "subjectivity": 0.7666666666666666,
    "include_for_labeling": "N"
  }
]