[
  {
    "id": "53ri5i",
    "title": "[Help] Which US carrier's version of the Note7 has all the features intact and works on both CDMA and GSM?",
    "selftext": "Hi guys, I'm trying to get a Note7 as soon as possible. I'm currently on Verizon but avoiding the Verizon Note7 like the plague since they removed some of the features from their version. I may also be switching to T-Mobile soon so I'd need a version that will work on both Verzion and T-Mobile  (Including 4G LTE). \n \nSo to summarize, I'm looking for a Note 7 that:       \n-has all the intended Samsung.     features (so isn't the Verizon version)  \n-can fully function on both Verizon and T-Mobile.    \n-won't explode.    \n \nAccording to this site I've been using the Tmobile version will work on Verizon, but don't know how accurate it is http://willmyphonework.net\n \nI know Samsung usually releases a Unlocked version of their phones after a few months which would be ideal but don't want to wait that long.\n \nI know I could also just get the Verizon version and install a custom firmware to restore the missing features, but I handle a lot of sensitive information on my phone and so would prefer to keep stock firmware since I'm paranoid about the security of third party firmwares.",
    "author": "Instincts",
    "created_utc": 1474432004.0,
    "created_date": "2016-09-21 12:26:44",
    "score": 0,
    "num_comments": 6,
    "url": "https://www.reddit.com/r/samsung/comments/53ri5i/help_which_us_carriers_version_of_the_note7_has/",
    "subreddit": "samsung",
    "search_query": "Note7",
    "subjectivity": 0.473,
    "post_type": "opinion",
    "extracted_comments": [],
    "num_extracted_comments": 0
  },
  {
    "id": "52o81j",
    "title": "This is a mess...",
    "selftext": "Like most people, this Note 7 recall has been a serious inconvenience. Verizon customer service has been awful, not one person has given me a straight answer. From the jist of the internet speak it sounds like I can either stick myself with another phone, grab a loaner that screws you out of months of your contract as well as being a serious downgrade, or watch my college dorm go up in flames. My phone doesn't get any hotter then any of my previous phones when charging so I can't rationalize spending all this time (stressed out enough as it) to try and return a phone that myself and my parents collectively dropped 700$ on. \n\nrant over",
    "author": "chazzz27",
    "created_utc": 1473817761.0,
    "created_date": "2016-09-14 09:49:21",
    "score": 2,
    "num_comments": 1,
    "url": "https://www.reddit.com/r/samsung/comments/52o81j/this_is_a_mess/",
    "subreddit": "samsung",
    "search_query": "Note 7 recall",
    "subjectivity": 0.509,
    "post_type": "opinion",
    "extracted_comments": [
      {
        "comment_id": "d7m0knr",
        "comment_text": "verizon will offer a temp phone such as the s7 of s7edge. Then you will be able to switch back to the Note 7. Make sure you are going to a corporate store. Out of the many times I called VZW customer serice, I finally talked to a rep that told me I could do this. I had him send me an email with the exact wording from Verizons policy. Of course I went to the store and they told me I was wrong until I showed them the email, then they were like \"ok, we can do that.\"  Its almost like they are being told not do offer this solution unless asked. If you have any questions, pm me. ",
        "comment_score": 2,
        "comment_author": "sillyslaw90",
        "comment_subjectivity": 0.5163888888888889
      }
    ],
    "num_extracted_comments": 1
  }
]